/* automatically generated by rust-bindgen 0.69.5 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {
        debug_assert!(bit_width <= 64);

pub const BB_SOCK_FLAG_TROC: u32 = 4;
pub const BB_SOCK_FLAG_DATAGRAM: u32 = 8;
pub const BB_SOCK_FLAG_SBUS: u32 = 16;
pub const BB_SOCK_FLAG_ENCRYPT: u32 = 32;
pub const BB_CHAN_HOP_AUTO: u32 = 1;
pub const BB_CHAN_BAND_HOP_AUTO: u32 = 2;
pub const BB_CHAN_COMPLIANCE: u32 = 4;
pub const BB_CHAN_MULTI_MODE: u32 = 8;
pub const BB_CHAN_SUBCHAN_ENABLE: u32 = 16;
pub const BB_MCS_SWITCH_ENABLE: u32 = 1;
pub const BB_MCS_SWITCH_AUTO: u32 = 2;
pub const BB_REQ_CFG: u32 = 0;
pub const BB_REQ_GET: u32 = 1;
pub const BB_REQ_SET: u32 = 2;
pub const BB_REQ_CB: u32 = 3;
pub const BB_REQ_SOCKET: u32 = 4;
pub const BB_REQ_DBG: u32 = 5;
pub const BB_REQ_REMOTE: u32 = 6;
pub const BB_REQ_RPC: u32 = 10;
pub const BB_REQ_RPC_IOCTL: u32 = 11;
pub const BB_REQ_PLAT_CTL: u32 = 12;
pub const SO_USER_BASE_START: u32 = 192;
pub const UART_NUM_MAX: u32 = 4;
pub const UART_LIST_MAX: u32 = 32;
pub const UART_NAME_LEN: u32 = 24;
pub const BB_CUSTOMER_KEY_LEN: u32 = 8;
pub const BB_PT_TEST_ITEM_NUM_MAX: u32 = 32;
pub const PRJ_PSRAM_FILENAME_LEN_MAX: u32 = 256;
pub const AT_PARTITION_NAME: &[u8; 9] = b"factory1\0";
pub const AT_PARTITION_OFFSET: u32 = 0;
pub const AT_PARTITION_SIZE: u32 = 4096;
pub const AT_DO_PAIR_TIMEOUT_DEFAULT: u32 = 12;
pub type va_list = *mut ::std::os::raw::c_char;
extern "C" {
    pub fn __va_start(arg1: *mut *mut ::std::os::raw::c_char, ...);
}
pub type __vcrt_bool = bool;
pub type wchar_t = ::std::os::raw::c_ushort;
extern "C" {
    pub fn __security_init_cookie();
}
extern "C" {
    pub fn __security_check_cookie(_StackCookie: usize);
}
extern "C" {
    pub fn __report_gsfailure(_StackCookie: usize) -> !;
}
extern "C" {
    pub static mut __security_cookie: usize;
}
pub type int_least8_t = ::std::os::raw::c_schar;
pub type int_least16_t = ::std::os::raw::c_short;
pub type int_least32_t = ::std::os::raw::c_int;
pub type int_least64_t = ::std::os::raw::c_longlong;
pub type uint_least8_t = ::std::os::raw::c_uchar;
pub type uint_least16_t = ::std::os::raw::c_ushort;
pub type uint_least32_t = ::std::os::raw::c_uint;
pub type uint_least64_t = ::std::os::raw::c_ulonglong;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_int;
pub type int_fast32_t = ::std::os::raw::c_int;
pub type int_fast64_t = ::std::os::raw::c_longlong;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_uint;
pub type uint_fast32_t = ::std::os::raw::c_uint;
pub type uint_fast64_t = ::std::os::raw::c_ulonglong;
pub type intmax_t = ::std::os::raw::c_longlong;
pub type uintmax_t = ::std::os::raw::c_ulonglong;
#[doc = "定义基带MAC地址"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_mac_t {
    #[doc = "<@note MAC地址字节"]
    pub addr: [u8; 4usize],
}
#[test]
fn bindgen_test_layout_bb_mac_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_mac_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_mac_t>(),
        4usize,
        concat!("Size of: ", stringify!(bb_mac_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_mac_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_mac_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_mac_t),
            "::",
            stringify!(addr)
        )
    );
}
#[doc = "<@note 发送方向"]
pub const bb_dir_e_BB_DIR_TX: bb_dir_e = 0;
#[doc = "<@note 接收方向"]
pub const bb_dir_e_BB_DIR_RX: bb_dir_e = 1;
pub const bb_dir_e_BB_DIR_MAX: bb_dir_e = 2;
#[doc = "定义基带通用的方向属性"]
pub type bb_dir_e = ::std::os::raw::c_int;
pub const bb_debug_id_e_BB_DBG_CLIENT_CHANGE: bb_debug_id_e = 0;
pub const bb_debug_id_e_BB_DBG_DATA: bb_debug_id_e = 1;
pub const bb_debug_id_e_BB_DBG_MAX: bb_debug_id_e = 2;
#[doc = "定义debug 通道 msgid"]
pub type bb_debug_id_e = ::std::os::raw::c_int;
#[doc = "<@note 100M工作频率"]
pub const bb_clk_sel_e_BB_CLK_100M_SEL: bb_clk_sel_e = 0;
#[doc = "<@note 200M工作频率"]
pub const bb_clk_sel_e_BB_CLK_200M_SEL: bb_clk_sel_e = 1;
#[doc = "定义8030基带工作频率"]
pub type bb_clk_sel_e = ::std::os::raw::c_int;
#[doc = "<@note 网络根节点设备"]
pub const bb_role_e_BB_ROLE_AP: bb_role_e = 0;
#[doc = "<@note 网络叶节点设备"]
pub const bb_role_e_BB_ROLE_DEV: bb_role_e = 1;
pub const bb_role_e_BB_ROLE_MAX: bb_role_e = 2;
#[doc = "定义基带基本角色"]
pub type bb_role_e = ::std::os::raw::c_int;
#[doc = "<@note 主设备"]
pub const bb_side_e_BB_SIDE_MASTER: bb_side_e = 0;
#[doc = "<@note 从设备"]
pub const bb_side_e_BB_SIDE_SLAVE: bb_side_e = 1;
pub const bb_side_e_BB_SIDE_MAX: bb_side_e = 2;
#[doc = "定义基带主从角色"]
pub type bb_side_e = ::std::os::raw::c_int;
#[doc = "<@note 单用户模式"]
pub const bb_mode_e_BB_MODE_SINGLE_USER: bb_mode_e = 0;
#[doc = "<@note 多用户模式"]
pub const bb_mode_e_BB_MODE_MULTI_USER: bb_mode_e = 1;
#[doc = "<@note 中继模式（暂不支持）"]
pub const bb_mode_e_BB_MODE_RELAY: bb_mode_e = 2;
#[doc = "<@note 导演模式-1对多可靠广播模式，不支持MCS负数"]
pub const bb_mode_e_BB_MODE_DIRECTOR: bb_mode_e = 3;
pub const bb_mode_e_BB_MODE_MAX: bb_mode_e = 4;
#[doc = "定义基带工作模式"]
pub type bb_mode_e = ::std::os::raw::c_int;
#[doc = "<@note 逻辑位置SLOT0"]
pub const bb_slot_e_BB_SLOT_0: bb_slot_e = 0;
#[doc = "<@attention DEV侧用于标识AP的逻辑位置"]
pub const bb_slot_e_BB_SLOT_AP: bb_slot_e = 0;
#[doc = "<@note 逻辑位置SLOT1"]
pub const bb_slot_e_BB_SLOT_1: bb_slot_e = 1;
#[doc = "<@note 逻辑位置SLOT2"]
pub const bb_slot_e_BB_SLOT_2: bb_slot_e = 2;
#[doc = "<@note 逻辑位置SLOT3"]
pub const bb_slot_e_BB_SLOT_3: bb_slot_e = 3;
#[doc = "<@note 逻辑位置SLOT4"]
pub const bb_slot_e_BB_SLOT_4: bb_slot_e = 4;
#[doc = "<@note 逻辑位置SLOT5"]
pub const bb_slot_e_BB_SLOT_5: bb_slot_e = 5;
#[doc = "<@note 逻辑位置SLOT6"]
pub const bb_slot_e_BB_SLOT_6: bb_slot_e = 6;
#[doc = "<@note 逻辑位置SLOT7"]
pub const bb_slot_e_BB_SLOT_7: bb_slot_e = 7;
pub const bb_slot_e_BB_SLOT_MAX: bb_slot_e = 8;
#[doc = "定义逻辑SLOT类型"]
pub type bb_slot_e = ::std::os::raw::c_int;
#[doc = "<@note 物理用户0"]
pub const bb_user_e_BB_USER_0: bb_user_e = 0;
#[doc = "<@note 物理用户1"]
pub const bb_user_e_BB_USER_1: bb_user_e = 1;
#[doc = "<@note 物理用户2"]
pub const bb_user_e_BB_USER_2: bb_user_e = 2;
#[doc = "<@note 物理用户3"]
pub const bb_user_e_BB_USER_3: bb_user_e = 3;
#[doc = "<@note 物理用户4"]
pub const bb_user_e_BB_USER_4: bb_user_e = 4;
#[doc = "<@note 物理用户5"]
pub const bb_user_e_BB_USER_5: bb_user_e = 5;
#[doc = "<@note 物理用户6"]
pub const bb_user_e_BB_USER_6: bb_user_e = 6;
#[doc = "<@note 物理用户7"]
pub const bb_user_e_BB_USER_7: bb_user_e = 7;
#[doc = "<@note 物理用户BR/CS"]
pub const bb_user_e_BB_USER_BR_CS: bb_user_e = 8;
#[doc = "<@note 物理用户BR2/CS2"]
pub const bb_user_e_BB_USER_BR2_CS2: bb_user_e = 9;
#[doc = "<@attention 最大数据用户标识，用于软件编程辅助"]
pub const bb_user_e_BB_DATA_USER_MAX: bb_user_e = 10;
#[doc = "<@note 物理长扫频用户"]
pub const bb_user_e_BB_USER_SWEEP: bb_user_e = 10;
#[doc = "<@note 物理短扫频用户"]
pub const bb_user_e_BB_USER_SWEEP_SHORT: bb_user_e = 11;
pub const bb_user_e_BB_USER_MAX: bb_user_e = 12;
#[doc = "定义基带物理用户类型"]
pub type bb_user_e = ::std::os::raw::c_int;
#[doc = "<@note BPSK   CR_1/2 REP_4 单流"]
pub const bb_phy_mcs_e_BB_PHY_MCS_NEG_2: bb_phy_mcs_e = 0;
#[doc = "<@note BPSK   CR_1/2 REP_2 单流"]
pub const bb_phy_mcs_e_BB_PHY_MCS_NEG_1: bb_phy_mcs_e = 1;
#[doc = "<@note BPSK   CR_1/2 REP_1 单流"]
pub const bb_phy_mcs_e_BB_PHY_MCS_0: bb_phy_mcs_e = 2;
#[doc = "<@note BPSK   CR_2/3 REP_1 单流"]
pub const bb_phy_mcs_e_BB_PHY_MCS_1: bb_phy_mcs_e = 3;
#[doc = "<@note BPSK   CR_3/4 REP_1 单流"]
pub const bb_phy_mcs_e_BB_PHY_MCS_2: bb_phy_mcs_e = 4;
#[doc = "<@note QPSK   CR_1/2 REP_1 单流"]
pub const bb_phy_mcs_e_BB_PHY_MCS_3: bb_phy_mcs_e = 5;
#[doc = "<@note QPSK   CR_2/3 REP_1 单流"]
pub const bb_phy_mcs_e_BB_PHY_MCS_4: bb_phy_mcs_e = 6;
#[doc = "<@note QPSK   CR_3/4 REP_1 单流"]
pub const bb_phy_mcs_e_BB_PHY_MCS_5: bb_phy_mcs_e = 7;
#[doc = "<@note 16QAM  CR_1/2 REP_1 单流"]
pub const bb_phy_mcs_e_BB_PHY_MCS_6: bb_phy_mcs_e = 8;
#[doc = "<@note 16QAM  CR_2/3 REP_1 单流"]
pub const bb_phy_mcs_e_BB_PHY_MCS_7: bb_phy_mcs_e = 9;
#[doc = "<@note 16QAM  CR_3/4 REP_1 单流"]
pub const bb_phy_mcs_e_BB_PHY_MCS_8: bb_phy_mcs_e = 10;
#[doc = "<@note 64QAM  CR_1/2 REP_1 单流"]
pub const bb_phy_mcs_e_BB_PHY_MCS_9: bb_phy_mcs_e = 11;
#[doc = "<@note 64QAM  CR_2/3 REP_1 单流"]
pub const bb_phy_mcs_e_BB_PHY_MCS_10: bb_phy_mcs_e = 12;
#[doc = "<@note 64QAM  CR_3/4 REP_1 单流"]
pub const bb_phy_mcs_e_BB_PHY_MCS_11: bb_phy_mcs_e = 13;
#[doc = "<@note 256QAM CR_1/2 REP_1 单流"]
pub const bb_phy_mcs_e_BB_PHY_MCS_12: bb_phy_mcs_e = 14;
#[doc = "<@note 256QAM CR_2/3 REP_1 单流"]
pub const bb_phy_mcs_e_BB_PHY_MCS_13: bb_phy_mcs_e = 15;
#[doc = "<@note QPSK   CR_1/2 REP_1 双流"]
pub const bb_phy_mcs_e_BB_PHY_MCS_14: bb_phy_mcs_e = 16;
#[doc = "<@note QPSK   CR_2/3 REP_1 双流"]
pub const bb_phy_mcs_e_BB_PHY_MCS_15: bb_phy_mcs_e = 17;
#[doc = "<@note QPSK   CR_3/4 REP_1 双流"]
pub const bb_phy_mcs_e_BB_PHY_MCS_16: bb_phy_mcs_e = 18;
#[doc = "<@note 16QAM  CR_1/2 REP_1 双流"]
pub const bb_phy_mcs_e_BB_PHY_MCS_17: bb_phy_mcs_e = 19;
#[doc = "<@note 16QAM  CR_2/3 REP_1 双流"]
pub const bb_phy_mcs_e_BB_PHY_MCS_18: bb_phy_mcs_e = 20;
#[doc = "<@note 16QAM  CR_3/4 REP_1 双流"]
pub const bb_phy_mcs_e_BB_PHY_MCS_19: bb_phy_mcs_e = 21;
#[doc = "<@note 64QAM  CR_1/2 REP_1 双流"]
pub const bb_phy_mcs_e_BB_PHY_MCS_20: bb_phy_mcs_e = 22;
#[doc = "<@note 64QAM  CR_2/3 REP_1 双流"]
pub const bb_phy_mcs_e_BB_PHY_MCS_21: bb_phy_mcs_e = 23;
#[doc = "<@note 64QAM  CR_3/4 REP_1 双流"]
pub const bb_phy_mcs_e_BB_PHY_MCS_22: bb_phy_mcs_e = 24;
pub const bb_phy_mcs_e_BB_PHY_MCS_MAX: bb_phy_mcs_e = 25;
#[doc = "定义基带MCS类型"]
pub type bb_phy_mcs_e = ::std::os::raw::c_int;
#[doc = "<@note SLOT数量固定不变"]
pub const bb_slot_mode_e_BB_SLOT_MODE_FIXED: bb_slot_mode_e = 0;
#[doc = "<@note 根据DEV的接入与退出，动态的调整帧结构"]
pub const bb_slot_mode_e_BB_SLOT_MODE_DYNAMIC: bb_slot_mode_e = 1;
#[doc = "定义多用户模式下的SLOT工作模式"]
pub type bb_slot_mode_e = ::std::os::raw::c_int;
#[doc = "<@note 空闲状态"]
pub const bb_link_state_e_BB_LINK_STATE_IDLE: bb_link_state_e = 0;
#[doc = "<@note 链路信道与对方Lock"]
pub const bb_link_state_e_BB_LINK_STATE_LOCK: bb_link_state_e = 1;
#[doc = "<@note 链路信道、数据信道都与对方Lock"]
pub const bb_link_state_e_BB_LINK_STATE_CONNECT: bb_link_state_e = 2;
pub const bb_link_state_e_BB_LINK_STATE_MAX: bb_link_state_e = 3;
#[doc = "定义SDK链路层设备状态"]
pub type bb_link_state_e = ::std::os::raw::c_int;
#[doc = "<@note 链路状态发生变化事件"]
pub const bb_event_e_BB_EVENT_LINK_STATE: bb_event_e = 0;
#[doc = "<@note MCS等级发生变化事件"]
pub const bb_event_e_BB_EVENT_MCS_CHANGE: bb_event_e = 1;
#[doc = "<@note 工作信道发生变化事件"]
pub const bb_event_e_BB_EVENT_CHAN_CHANGE: bb_event_e = 2;
#[doc = "<@note 用于debug的异步信号质量Plot数据"]
pub const bb_event_e_BB_EVENT_PLOT_DATA: bb_event_e = 3;
#[doc = "<@note 每一个基带帧开始的事件"]
pub const bb_event_e_BB_EVENT_FRAME_START: bb_event_e = 4;
#[doc = "<@note 当设备离线时获得通知           仅host侧有效"]
pub const bb_event_e_BB_EVENT_OFFLINE: bb_event_e = 5;
#[doc = "<@note 项目自定义事件分发"]
pub const bb_event_e_BB_EVENT_PRJ_DISPATCH: bb_event_e = 6;
#[doc = "<@note 配对结果事件分发"]
pub const bb_event_e_BB_EVENT_PAIR_RESULT: bb_event_e = 7;
#[doc = "<@note 项目自定义事件分发2(用于USB RPC)"]
pub const bb_event_e_BB_EVENT_PRJ_DISPATCH2: bb_event_e = 8;
#[doc = "<@note MCS等级发生变化结束事件"]
pub const bb_event_e_BB_EVENT_MCS_CHANGE_END: bb_event_e = 9;
#[doc = "<@note 项目自定义事件分发2(用于UART RPC)"]
pub const bb_event_e_BB_EVENT_PRJ_DISPATCH2_UART: bb_event_e = 10;
#[doc = "<@note 项目自定义事件分发2(用于SDIO RPC)"]
pub const bb_event_e_BB_EVENT_PRJ_DISPATCH2_SDIO: bb_event_e = 11;
#[doc = "<@note BW发生变化事件"]
pub const bb_event_e_BB_EVENT_BW_CHANGE: bb_event_e = 12;
#[doc = "<@note 帧帧上报"]
pub const bb_event_e_BB_EVENT_FRAME_PLOT: bb_event_e = 13;
#[doc = "<@note 工作频点发生变化事件"]
pub const bb_event_e_BB_EVENT_FREQ_CHANGE: bb_event_e = 14;
pub const bb_event_e_BB_EVENT_FSP: bb_event_e = 15;
pub const bb_event_e_BB_EVENT_MAX: bb_event_e = 16;
#[doc = "定义SDK的callback事件类型"]
pub type bb_event_e = ::std::os::raw::c_int;
#[doc = "定义SDK内统一信道类型"]
pub type chan_t = u16;
#[doc = "定义8030物理用户信号质量结构体"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_quality_t {
    #[doc = "<@note 物理用户接收信噪比，转化db公式：10log(snr/36)"]
    pub snr: u16,
    #[doc = "<@note 交织块中解码错误的LDPC块个数"]
    pub ldpc_err: u16,
    #[doc = "<@note 交织块中总的LDPC块个数"]
    pub ldpc_num: u16,
    #[doc = "<@note A路天线接收信号强度"]
    pub gain_a: u8,
    #[doc = "<@note B路天线接收信号强度"]
    pub gain_b: u8,
}
#[test]
fn bindgen_test_layout_bb_quality_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_quality_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_quality_t>(),
        8usize,
        concat!("Size of: ", stringify!(bb_quality_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_quality_t>(),
        2usize,
        concat!("Alignment of ", stringify!(bb_quality_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).snr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_quality_t),
            "::",
            stringify!(snr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ldpc_err) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_quality_t),
            "::",
            stringify!(ldpc_err)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ldpc_num) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_quality_t),
            "::",
            stringify!(ldpc_num)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gain_a) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_quality_t),
            "::",
            stringify!(gain_a)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gain_b) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_quality_t),
            "::",
            stringify!(gain_b)
        )
    );
}
#[doc = "<@note 1G: 150MHZ  ~ 1000MHZ"]
pub const bb_band_e_BB_BAND_1G: bb_band_e = 0;
#[doc = "<@note 2G: 1000MHZ ~ 4000MHZ"]
pub const bb_band_e_BB_BAND_2G: bb_band_e = 1;
#[doc = "<@note 5G: 4000MHZ ~ 7000MHZ"]
pub const bb_band_e_BB_BAND_5G: bb_band_e = 2;
pub const bb_band_e_BB_BAND_MAX: bb_band_e = 3;
#[doc = "定义8030支持的的频段类型"]
pub type bb_band_e = ::std::os::raw::c_int;
#[doc = "<@note 射频A路"]
pub const bb_rf_path_e_BB_RF_PATH_A: bb_rf_path_e = 0;
#[doc = "<@note 射频B路"]
pub const bb_rf_path_e_BB_RF_PATH_B: bb_rf_path_e = 1;
pub const bb_rf_path_e_BB_RF_PATH_MAX: bb_rf_path_e = 2;
#[doc = "定义8030射频通道类型"]
pub type bb_rf_path_e = ::std::os::raw::c_int;
#[doc = "<@note 单频模式"]
pub const bb_band_mode_e_BB_BAND_MODE_SINGLE: bb_band_mode_e = 0;
#[doc = "<@note 2G和5G组合"]
pub const bb_band_mode_e_BB_BAND_MODE_2G_5G: bb_band_mode_e = 1;
#[doc = "<@note 1G和2G组合"]
pub const bb_band_mode_e_BB_BAND_MODE_1G_2G: bb_band_mode_e = 2;
#[doc = "<@note 1G和5G组合"]
pub const bb_band_mode_e_BB_BAND_MODE_1G_5G: bb_band_mode_e = 3;
pub const bb_band_mode_e_BB_BAND_MODE_MAX: bb_band_mode_e = 4;
#[doc = "定义当前工作频段模式"]
pub type bb_band_mode_e = ::std::os::raw::c_int;
#[doc = "<@note 1.25MHZ"]
pub const bb_bandwidth_e_BB_BW_1_25M: bb_bandwidth_e = 0;
#[doc = "<@note 2.5MHZ"]
pub const bb_bandwidth_e_BB_BW_2_5M: bb_bandwidth_e = 1;
#[doc = "<@note 5MHZ"]
pub const bb_bandwidth_e_BB_BW_5M: bb_bandwidth_e = 2;
#[doc = "<@note 10MHZ"]
pub const bb_bandwidth_e_BB_BW_10M: bb_bandwidth_e = 3;
#[doc = "<@note 20MHZ"]
pub const bb_bandwidth_e_BB_BW_20M: bb_bandwidth_e = 4;
#[doc = "<@note 40MHZ"]
pub const bb_bandwidth_e_BB_BW_40M: bb_bandwidth_e = 5;
pub const bb_bandwidth_e_BB_BW_MAX: bb_bandwidth_e = 6;
#[doc = "定义8030支持的频宽类型"]
pub type bb_bandwidth_e = ::std::os::raw::c_int;
#[doc = "<@note 3  OFDM"]
pub const bb_timeintlv_len_e_BB_TIMEINTLV_LEN_3: bb_timeintlv_len_e = 0;
#[doc = "<@note 6  OFDM"]
pub const bb_timeintlv_len_e_BB_TIMEINTLV_LEN_6: bb_timeintlv_len_e = 1;
#[doc = "<@note 12 OFDM"]
pub const bb_timeintlv_len_e_BB_TIMEINTLV_LEN_12: bb_timeintlv_len_e = 2;
#[doc = "<@note 24 OFDM"]
pub const bb_timeintlv_len_e_BB_TIMEINTLV_LEN_24: bb_timeintlv_len_e = 3;
#[doc = "<@note 48 OFDM"]
pub const bb_timeintlv_len_e_BB_TIMEINTLV_LEN_48: bb_timeintlv_len_e = 4;
pub const bb_timeintlv_len_e_BB_TIMEINTLV_LEN_MAX: bb_timeintlv_len_e = 5;
#[doc = "定义8030支持的交织块长度"]
pub type bb_timeintlv_len_e = ::std::os::raw::c_int;
#[doc = "<@note 交织块时域不交织"]
pub const bb_timeintlv_enable_e_BB_TIMEINTLV_OFF: bb_timeintlv_enable_e = 0;
#[doc = "<@note 交织块时域交织"]
pub const bb_timeintlv_enable_e_BB_TIMEINTLV_ON: bb_timeintlv_enable_e = 1;
pub const bb_timeintlv_enable_e_BB_TIMEINTLV_ENABLE_MAX: bb_timeintlv_enable_e = 2;
#[doc = "定义8030交织类型"]
pub type bb_timeintlv_enable_e = ::std::os::raw::c_int;
#[doc = "<@note 一个交织块"]
pub const bb_timeintlv_num_e_BB_TIMEINTLV_1_BLOCK: bb_timeintlv_num_e = 0;
#[doc = "<@note 两个交织块"]
pub const bb_timeintlv_num_e_BB_TIMEINTLV_2_BLOCK: bb_timeintlv_num_e = 1;
pub const bb_timeintlv_num_e_BB_TIMEINTLV_NUM_MAX: bb_timeintlv_num_e = 2;
#[doc = "定义8030支持的交织块数量"]
pub type bb_timeintlv_num_e = ::std::os::raw::c_int;
#[doc = "<@attention slot内有payload"]
pub const bb_payload_e_BB_PAYLOAD_ON: bb_payload_e = 0;
#[doc = "<@attention slot内没有payload"]
pub const bb_payload_e_BB_PAYLOAD_OFF: bb_payload_e = 1;
pub const bb_payload_e_BB_PAYLOAD_MAX: bb_payload_e = 2;
#[doc = "定义8030 slot内是否需要payload"]
pub type bb_payload_e = ::std::os::raw::c_int;
#[doc = "<@attention 96bits FCH, 默认推荐"]
pub const bb_fch_info_len_e_BB_FCH_INFO_96BITS: bb_fch_info_len_e = 0;
#[doc = "<@attention 48bits FCH, 谨慎使用"]
pub const bb_fch_info_len_e_BB_FCH_INFO_48BITS: bb_fch_info_len_e = 1;
#[doc = "<@attention 192bits FCH"]
pub const bb_fch_info_len_e_BB_FCH_INFO_192BITS: bb_fch_info_len_e = 2;
pub const bb_fch_info_len_e_BB_FCH_INFO_MAX: bb_fch_info_len_e = 3;
#[doc = "定义8030 FCH的长度模式"]
pub type bb_fch_info_len_e = ::std::os::raw::c_int;
#[doc = "<@note 单天线发送信号"]
pub const bb_tx_mode_e_BB_TX_1TX: bb_tx_mode_e = 0;
#[doc = "<@note 双天线发送相关信号"]
pub const bb_tx_mode_e_BB_TX_2TX_STBC: bb_tx_mode_e = 1;
#[doc = "<@note 双天线发送独立信号"]
pub const bb_tx_mode_e_BB_TX_2TX_MIMO: bb_tx_mode_e = 2;
pub const bb_tx_mode_e_BB_TX_MODE_MAX: bb_tx_mode_e = 3;
#[doc = "定义8030支持的RF发送模式"]
pub type bb_tx_mode_e = ::std::os::raw::c_int;
#[doc = "<@note 单天线接收信号"]
pub const bb_rx_mode_e_BB_RX_1T1R: bb_rx_mode_e = 0;
#[doc = "<@note 双天线接收对端的单发信号"]
pub const bb_rx_mode_e_BB_RX_1T2R: bb_rx_mode_e = 1;
#[doc = "<@note 双天线接收对方的双发STBC信号"]
pub const bb_rx_mode_e_BB_RX_2T2R_STBC: bb_rx_mode_e = 2;
#[doc = "<@note 双天线接收对方的双发MIMO信号"]
pub const bb_rx_mode_e_BB_RX_2T2R_MIMO: bb_rx_mode_e = 3;
pub const bb_rx_mode_e_BB_RX_MODE_MAX: bb_rx_mode_e = 4;
#[doc = "定义8030支持的RF接收模式"]
pub type bb_rx_mode_e = ::std::os::raw::c_int;
#[doc = "<@note 开环模式"]
pub const bb_phy_pwr_mode_e_BB_PHY_PWR_OPENLOOP: bb_phy_pwr_mode_e = 0;
#[doc = "<@note 闭环模式"]
pub const bb_phy_pwr_mode_e_BB_PHY_PWR_CLOSELOOP: bb_phy_pwr_mode_e = 1;
#[doc = "定义8030功率模式"]
pub type bb_phy_pwr_mode_e = ::std::os::raw::c_int;
#[doc = "<@note 固定模式"]
pub const bb_br_hop_mode_e_BB_BR_HOP_MODE_MANU: bb_br_hop_mode_e = 0;
#[doc = "<@note 自动跳频"]
pub const bb_br_hop_mode_e_BB_BR_HOP_MODE_AUTO: bb_br_hop_mode_e = 1;
pub const bb_br_hop_mode_e_BB_BR_HOP_MODE_MAX: bb_br_hop_mode_e = 2;
pub type bb_br_hop_mode_e = ::std::os::raw::c_int;
#[doc = "<@note BR hop on idle循环跳频"]
pub const bb_br_hop_on_idle_policy_e_BB_BR_HOP_ON_IDLE_ROUND_HOP: bb_br_hop_on_idle_policy_e = 0;
#[doc = "<@note BR hop on idle基于扫频结果跳频"]
pub const bb_br_hop_on_idle_policy_e_BB_BR_HOP_ON_IDLE_FS_RESULT: bb_br_hop_on_idle_policy_e = 1;
pub type bb_br_hop_on_idle_policy_e = ::std::os::raw::c_int;
pub const bb_band_hop_item_e_BB_BAND_HOP_2G_2_5G: bb_band_hop_item_e = 0;
pub const bb_band_hop_item_e_BB_BAND_HOP_5G_2_2G: bb_band_hop_item_e = 1;
pub const bb_band_hop_item_e_BB_BAND_HOP_ITEM_MAX: bb_band_hop_item_e = 2;
#[doc = "定义8030 auto band的切换类型"]
pub type bb_band_hop_item_e = ::std::os::raw::c_int;
pub const bb_dfs_type_e_BB_DFS_TYPE_FCC: bb_dfs_type_e = 0;
pub const bb_dfs_type_e_BB_DFS_TYPE_CE: bb_dfs_type_e = 1;
#[doc = "定义dfs认证类型"]
pub type bb_dfs_type_e = ::std::os::raw::c_int;
pub const bb_dfs_sub_cmd_e_BB_DFS_CONF_GET: bb_dfs_sub_cmd_e = 0;
pub const bb_dfs_sub_cmd_e_BB_DFS_CONF_SET: bb_dfs_sub_cmd_e = 1;
pub const bb_dfs_sub_cmd_e_BB_DFS_EVENT: bb_dfs_sub_cmd_e = 2;
#[doc = "定义dfs操作类型"]
pub type bb_dfs_sub_cmd_e = ::std::os::raw::c_int;
pub const bb_mcs_auto_mode_policy_e_BB_MCS_AUTO_MODE_POLICY_DELAY: bb_mcs_auto_mode_policy_e = 0;
pub const bb_mcs_auto_mode_policy_e_BB_MCS_AUTO_MODE_POLICY_THROUGHPUT: bb_mcs_auto_mode_policy_e =
    1;
pub const bb_mcs_auto_mode_policy_e_BB_MCS_AUTO_MODE_POLICY_MAX: bb_mcs_auto_mode_policy_e = 2;
#[doc = "定义mcs自动切换策略"]
pub type bb_mcs_auto_mode_policy_e = ::std::os::raw::c_int;
#[doc = "定义链路状态变化的事件结构体"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_event_link_state_t {
    #[doc = "<@note 链路状态发生位置, 类型：bb_slot_e"]
    pub slot: u8,
    #[doc = "<@note 链路当前状态，类型：bb_link_state_e"]
    pub cur_state: u8,
    #[doc = "<@note 链路之前状态，类型：bb_link_state_e"]
    pub prev_state: u8,
}
#[test]
fn bindgen_test_layout_bb_event_link_state_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_event_link_state_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_event_link_state_t>(),
        3usize,
        concat!("Size of: ", stringify!(bb_event_link_state_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_event_link_state_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_event_link_state_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).slot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_event_link_state_t),
            "::",
            stringify!(slot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cur_state) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_event_link_state_t),
            "::",
            stringify!(cur_state)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prev_state) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_event_link_state_t),
            "::",
            stringify!(prev_state)
        )
    );
}
#[doc = "定义MCS等级变化的事件结构体"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_event_mcs_change_t {
    #[doc = "<@note MCS等级发生位置, 类型：bb_slot_e"]
    pub slot: u8,
    #[doc = "<@note MCS等级变化的方向, 类型：bb_dir_e"]
    pub dir: u8,
    #[doc = "<@note 当前MCS等级, 类型：bb_phy_mcs_e"]
    pub cur_mcs: u8,
    #[doc = "<@note 之前MCS等级, 类型：bb_phy_mcs_e"]
    pub prev_mcs: u8,
}
#[test]
fn bindgen_test_layout_bb_event_mcs_change_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_event_mcs_change_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_event_mcs_change_t>(),
        4usize,
        concat!("Size of: ", stringify!(bb_event_mcs_change_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_event_mcs_change_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_event_mcs_change_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).slot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_event_mcs_change_t),
            "::",
            stringify!(slot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dir) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_event_mcs_change_t),
            "::",
            stringify!(dir)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cur_mcs) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_event_mcs_change_t),
            "::",
            stringify!(cur_mcs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prev_mcs) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_event_mcs_change_t),
            "::",
            stringify!(prev_mcs)
        )
    );
}
#[doc = "定义频宽变化的事件结构体"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_event_bw_change_t {
    #[doc = "<@note BW发生位置, 类型：bb_slot_e"]
    pub slot: u8,
    #[doc = "<@note BW变化的方向, 类型：bb_dir_e"]
    pub dir: u8,
    #[doc = "<@note 当前BW, 类型：bb_bandwidth_e"]
    pub cur_bw: u8,
    #[doc = "<@note 当前BW, 类型：bb_bandwidth_e"]
    pub prev_bw: u8,
}
#[test]
fn bindgen_test_layout_bb_event_bw_change_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_event_bw_change_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_event_bw_change_t>(),
        4usize,
        concat!("Size of: ", stringify!(bb_event_bw_change_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_event_bw_change_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_event_bw_change_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).slot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_event_bw_change_t),
            "::",
            stringify!(slot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dir) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_event_bw_change_t),
            "::",
            stringify!(dir)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cur_bw) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_event_bw_change_t),
            "::",
            stringify!(cur_bw)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prev_bw) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_event_bw_change_t),
            "::",
            stringify!(prev_bw)
        )
    );
}
#[doc = "定义MCS等级变化的事件结构体"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_event_mcs_change_end_t {
    pub info: bb_event_mcs_change_t,
    pub tx_result: u32,
    pub pkt_num: u8,
}
#[test]
fn bindgen_test_layout_bb_event_mcs_change_end_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_event_mcs_change_end_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_event_mcs_change_end_t>(),
        12usize,
        concat!("Size of: ", stringify!(bb_event_mcs_change_end_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_event_mcs_change_end_t>(),
        4usize,
        concat!("Alignment of ", stringify!(bb_event_mcs_change_end_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).info) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_event_mcs_change_end_t),
            "::",
            stringify!(info)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tx_result) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_event_mcs_change_end_t),
            "::",
            stringify!(tx_result)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pkt_num) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_event_mcs_change_end_t),
            "::",
            stringify!(pkt_num)
        )
    );
}
#[doc = "定义信道发生变化的事件结构体"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_event_chan_change_t {
    #[doc = "<@attention 发生信道变化的位置，类型：bb_slot_e。如果dir参数为RX，则本字段无意义，即当前SDK，RX侧信道改变时，对所有SLOT同步改变"]
    pub slot: u8,
    #[doc = "<@note 信道变化的方向, 类型：bb_dir_e"]
    pub dir: u8,
    #[doc = "<@note 当前信道, 类型：uint8_t 信道索引值"]
    pub cur_chan: u8,
    #[doc = "<@note 之前信道, 类型：uint8_t 信道索引值"]
    pub prev_chan: u8,
}
#[test]
fn bindgen_test_layout_bb_event_chan_change_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_event_chan_change_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_event_chan_change_t>(),
        4usize,
        concat!("Size of: ", stringify!(bb_event_chan_change_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_event_chan_change_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_event_chan_change_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).slot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_event_chan_change_t),
            "::",
            stringify!(slot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dir) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_event_chan_change_t),
            "::",
            stringify!(dir)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cur_chan) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_event_chan_change_t),
            "::",
            stringify!(cur_chan)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prev_chan) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_event_chan_change_t),
            "::",
            stringify!(prev_chan)
        )
    );
}
#[doc = "定义频点发生变化的事件结构体"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_event_freq_change_t {
    #[doc = "<@attention 发生信道变化的位置，类型：bb_slot_e。如果dir参数为RX，则本字段无意义，即当前SDK，RX侧信道改变时，对所有SLOT同步改变"]
    pub slot: u8,
    #[doc = "<@note 信道变化的方向, 类型：bb_dir_e"]
    pub dir: u8,
    pub padding: [u8; 2usize],
    #[doc = "<@note 当前频点"]
    pub cur_freq_khz: u32,
    #[doc = "<@note 之前频点"]
    pub prev_freq_khz: u32,
}
#[test]
fn bindgen_test_layout_bb_event_freq_change_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_event_freq_change_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_event_freq_change_t>(),
        12usize,
        concat!("Size of: ", stringify!(bb_event_freq_change_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_event_freq_change_t>(),
        4usize,
        concat!("Alignment of ", stringify!(bb_event_freq_change_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).slot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_event_freq_change_t),
            "::",
            stringify!(slot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dir) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_event_freq_change_t),
            "::",
            stringify!(dir)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_event_freq_change_t),
            "::",
            stringify!(padding)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cur_freq_khz) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_event_freq_change_t),
            "::",
            stringify!(cur_freq_khz)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prev_freq_khz) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_event_freq_change_t),
            "::",
            stringify!(prev_freq_khz)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_plot_data_t {
    #[doc = "<@note 信噪比"]
    pub snr: u16,
    #[doc = "<@note LDPC错误数"]
    pub ldpc_err: u16,
    #[doc = "<@note LDPC总数"]
    pub ldpc_num: u16,
    #[doc = "<@note A路天线GAIN"]
    pub gain_a: u8,
    #[doc = "<@note B路天线GAIN"]
    pub gain_b: u8,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    #[doc = "<@note br发射功率"]
    pub br_power: u8,
    #[doc = "<@note slot本地发射功率"]
    pub power: u8,
    #[doc = "<@note slot对端发射功率"]
    pub peer_power: u8,
    #[doc = "<@note padding to 32 Bytes"]
    pub padding: [u8; 20usize],
}
#[test]
fn bindgen_test_layout_bb_plot_data_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_plot_data_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_plot_data_t>(),
        32usize,
        concat!("Size of: ", stringify!(bb_plot_data_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_plot_data_t>(),
        2usize,
        concat!("Alignment of ", stringify!(bb_plot_data_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).snr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_plot_data_t),
            "::",
            stringify!(snr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ldpc_err) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_plot_data_t),
            "::",
            stringify!(ldpc_err)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ldpc_num) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_plot_data_t),
            "::",
            stringify!(ldpc_num)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gain_a) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_plot_data_t),
            "::",
            stringify!(gain_a)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gain_b) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_plot_data_t),
            "::",
            stringify!(gain_b)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).br_power) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_plot_data_t),
            "::",
            stringify!(br_power)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).power) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_plot_data_t),
            "::",
            stringify!(power)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).peer_power) as usize - ptr as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_plot_data_t),
            "::",
            stringify!(peer_power)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_plot_data_t),
            "::",
            stringify!(padding)
        )
    );
}
impl bb_plot_data_t {
    #[inline]
    pub fn mcs_rx(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 5u8) as u8) }
    }
    #[inline]
    pub fn set_mcs_rx(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn fch_lock(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_fch_lock(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(mcs_rx: u8, fch_lock: u8) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 5u8, {
            let mcs_rx: u8 = unsafe { ::std::mem::transmute(mcs_rx) };
            mcs_rx as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let fch_lock: u8 = unsafe { ::std::mem::transmute(fch_lock) };
            fch_lock as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "定义异步Plot Data数据结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_event_plot_data_t {
    pub user: u8,
    pub plot_num: u8,
    pub plot_data: [bb_plot_data_t; 10usize],
}
#[test]
fn bindgen_test_layout_bb_event_plot_data_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_event_plot_data_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_event_plot_data_t>(),
        322usize,
        concat!("Size of: ", stringify!(bb_event_plot_data_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_event_plot_data_t>(),
        2usize,
        concat!("Alignment of ", stringify!(bb_event_plot_data_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).user) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_event_plot_data_t),
            "::",
            stringify!(user)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).plot_num) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_event_plot_data_t),
            "::",
            stringify!(plot_num)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).plot_data) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_event_plot_data_t),
            "::",
            stringify!(plot_data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_event_frame_start_t {
    #[doc = "<@note slot状态 类型：bb_link_stat_e"]
    pub slot_state: [u8; 8usize],
}
#[test]
fn bindgen_test_layout_bb_event_frame_start_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_event_frame_start_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_event_frame_start_t>(),
        8usize,
        concat!("Size of: ", stringify!(bb_event_frame_start_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_event_frame_start_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_event_frame_start_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).slot_state) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_event_frame_start_t),
            "::",
            stringify!(slot_state)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_dev_info_t {
    pub mac: [u8; 32usize],
    pub maclen: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_bb_dev_info_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_dev_info_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_dev_info_t>(),
        36usize,
        concat!("Size of: ", stringify!(bb_dev_info_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_dev_info_t>(),
        4usize,
        concat!("Alignment of ", stringify!(bb_dev_info_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mac) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_dev_info_t),
            "::",
            stringify!(mac)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).maclen) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_dev_info_t),
            "::",
            stringify!(maclen)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_event_hotplug_t {
    pub id: u32,
    pub status: u32,
    pub bb_mac: bb_dev_info_t,
}
#[test]
fn bindgen_test_layout_bb_event_hotplug_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_event_hotplug_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_event_hotplug_t>(),
        44usize,
        concat!("Size of: ", stringify!(bb_event_hotplug_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_event_hotplug_t>(),
        4usize,
        concat!("Alignment of ", stringify!(bb_event_hotplug_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_event_hotplug_t),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_event_hotplug_t),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bb_mac) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_event_hotplug_t),
            "::",
            stringify!(bb_mac)
        )
    );
}
#[doc = "定义项目自定义异步事件结构体"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bb_event_prj_dispatch_t {
    pub data: [u8; 256usize],
}
#[test]
fn bindgen_test_layout_bb_event_prj_dispatch_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_event_prj_dispatch_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_event_prj_dispatch_t>(),
        256usize,
        concat!("Size of: ", stringify!(bb_event_prj_dispatch_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_event_prj_dispatch_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_event_prj_dispatch_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_event_prj_dispatch_t),
            "::",
            stringify!(data)
        )
    );
}
impl Default for bb_event_prj_dispatch_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "定义项目自定义异步事件结构体"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bb_event_prj_dispatch2_t {
    pub length: u16,
    #[doc = "二级分发内容长度"]
    pub data: [u8; 1022usize],
}
#[test]
fn bindgen_test_layout_bb_event_prj_dispatch2_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_event_prj_dispatch2_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_event_prj_dispatch2_t>(),
        1024usize,
        concat!("Size of: ", stringify!(bb_event_prj_dispatch2_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_event_prj_dispatch2_t>(),
        2usize,
        concat!("Alignment of ", stringify!(bb_event_prj_dispatch2_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).length) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_event_prj_dispatch2_t),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_event_prj_dispatch2_t),
            "::",
            stringify!(data)
        )
    );
}
impl Default for bb_event_prj_dispatch2_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "定义FS PRO事件结构体"]
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct bb_event_fsp_t {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 6usize]>,
    pub __bindgen_padding_0: [u8; 2usize],
    #[doc = "数据长度"]
    pub data: [u8; 768usize],
}
#[test]
fn bindgen_test_layout_bb_event_fsp_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_event_fsp_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_event_fsp_t>(),
        776usize,
        concat!("Size of: ", stringify!(bb_event_fsp_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_event_fsp_t>(),
        4usize,
        concat!("Alignment of ", stringify!(bb_event_fsp_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_event_fsp_t),
            "::",
            stringify!(data)
        )
    );
}
impl Default for bb_event_fsp_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl bb_event_fsp_t {
    #[inline]
    pub fn frame_id(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_frame_id(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn num(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_num(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn type_(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(24usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_type(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(24usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn len(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(32usize, 10u8) as u32) }
    }
    #[inline]
    pub fn set_len(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(32usize, 10u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        frame_id: u32,
        num: u32,
        type_: u32,
        len: u32,
    ) -> __BindgenBitfieldUnit<[u8; 6usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 6usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 16u8, {
            let frame_id: u32 = unsafe { ::std::mem::transmute(frame_id) };
            frame_id as u64
        });
        __bindgen_bitfield_unit.set(16usize, 8u8, {
            let num: u32 = unsafe { ::std::mem::transmute(num) };
            num as u64
        });
        __bindgen_bitfield_unit.set(24usize, 4u8, {
            let type_: u32 = unsafe { ::std::mem::transmute(type_) };
            type_ as u64
        });
        __bindgen_bitfield_unit.set(32usize, 10u8, {
            let len: u32 = unsafe { ::std::mem::transmute(len) };
            len as u64
        });
        __bindgen_bitfield_unit
    }
}
pub const bb_fsp_notify_type_e_BB_FSP_NOTIFY_TYPE_FREQ_LIST: bb_fsp_notify_type_e = 0;
#[doc = "扫频频点列表"]
pub const bb_fsp_notify_type_e_BB_FSP_NOTIFY_TYPE_FS_RESULT: bb_fsp_notify_type_e = 1;
#[doc = "扫频结果"]
pub const bb_fsp_notify_type_e_BB_FSP_NOTIFY_TYPE_CANDIDATE: bb_fsp_notify_type_e = 2;
#[doc = "候选频点"]
pub const bb_fsp_notify_type_e_BB_FSP_NOTIFY_TYPE_DIFF: bb_fsp_notify_type_e = 3;
#[doc = "平方差模式"]
pub const bb_fsp_notify_type_e_BB_FSP_NOTIFY_TYPE_HIST: bb_fsp_notify_type_e = 4;
#[doc = "直方图模式"]
pub const bb_fsp_notify_type_e_BB_FSP_NOTIFY_TYPE_MAX: bb_fsp_notify_type_e = 5;
#[doc = "定义FS PRO通知类型枚举"]
pub type bb_fsp_notify_type_e = ::std::os::raw::c_int;
pub const ctl_opt_sock_opt_echo: ctl_opt = 0;
pub type ctl_opt = ::std::os::raw::c_int;
pub const bb_sock_cmd_e_BB_SOCK_QUERY_TX_BUFF_LEN: bb_sock_cmd_e = 0;
pub const bb_sock_cmd_e_BB_SOCK_QUERY_RX_BUFF_LEN: bb_sock_cmd_e = 1;
pub const bb_sock_cmd_e_BB_SOCK_READ_INV_DATA: bb_sock_cmd_e = 2;
pub const bb_sock_cmd_e_BB_SOCK_SET_TX_LIMIT: bb_sock_cmd_e = 3;
pub const bb_sock_cmd_e_BB_SOCK_GET_TX_LIMIT: bb_sock_cmd_e = 4;
pub const bb_sock_cmd_e_BB_SOCK_IOCTL_ECHO: bb_sock_cmd_e = 192;
pub const bb_sock_cmd_e_BB_SOCK_TX_LEN_GET: bb_sock_cmd_e = 193;
pub const bb_sock_cmd_e_BB_SOCK_TX_LEN_RESET: bb_sock_cmd_e = 194;
pub const bb_sock_cmd_e_BB_SOCK_ENC_SET: bb_sock_cmd_e = 195;
pub const bb_sock_cmd_e_BB_SOCK_ENC_GET: bb_sock_cmd_e = 196;
pub const bb_sock_cmd_e_BB_SOCK_IOCTL_MAX: bb_sock_cmd_e = 197;
#[doc = "定义socket的控制命令字"]
pub type bb_sock_cmd_e = ::std::os::raw::c_int;
#[doc = "<@attention int8_t func(int tab, int chan)"]
pub const bb_cb_type_e_BB_CB_TYPE_FREQ_PWR_OFFSET: bb_cb_type_e = 0;
pub const bb_cb_type_e_BB_CB_TYPE_MAX: bb_cb_type_e = 1;
#[doc = "项目层面注册的回调函数类型"]
pub type bb_cb_type_e = ::std::os::raw::c_int;
#[doc = "<@attention 默认加密模式，不使用key字段"]
pub const bb_sock_encrypt_mode_t_BB_SOCK_ENCRYPT_MODE_DEFAULT: bb_sock_encrypt_mode_t = 0;
#[doc = "<@attention AES128模式，key字段使用前16字节"]
pub const bb_sock_encrypt_mode_t_BB_SOCK_ENCRYPT_MODE_AES128: bb_sock_encrypt_mode_t = 1;
#[doc = "<@attention AES256模式，key字段使用32字节"]
pub const bb_sock_encrypt_mode_t_BB_SOCK_ENCRYPT_MODE_AES256: bb_sock_encrypt_mode_t = 2;
pub const bb_sock_encrypt_mode_t_BB_SOCK_ENCRYPT_MODE_MAX: bb_sock_encrypt_mode_t = 3;
#[doc = "定义socket的加密类型"]
pub type bb_sock_encrypt_mode_t = ::std::os::raw::c_int;
#[doc = "定义数传socket创建时的自定义参数"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bb_sock_opt_t {
    #[doc = "<@attention 用于指定发送buffer的大小，创建的socket具备TX属性时有效"]
    pub tx_buf_size: u32,
    #[doc = "<@attention 用于指定接收buffer的大小，创建的socket具备RX属性时有效"]
    pub rx_buf_size: u32,
    #[doc = "<@attention 仅芯片侧有效 由8030侧应用指定tx buffer的内存地址 20250205"]
    pub tx_buf: *mut ::std::os::raw::c_void,
    #[doc = "<@attention 仅芯片侧有效 由8030侧应用指定rx buffer的内存地址 20250205"]
    pub rx_buf: *mut ::std::os::raw::c_void,
    #[doc = "<@attention 创建加密通道时指定加密模式，类型为bb_sock_encrypt_mode_t"]
    pub encrypt_mode: u8,
    #[doc = "<@attention 创建加密通道时指定密钥"]
    pub key: [u8; 32usize],
}
#[test]
fn bindgen_test_layout_bb_sock_opt_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_sock_opt_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_sock_opt_t>(),
        64usize,
        concat!("Size of: ", stringify!(bb_sock_opt_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_sock_opt_t>(),
        8usize,
        concat!("Alignment of ", stringify!(bb_sock_opt_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tx_buf_size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_sock_opt_t),
            "::",
            stringify!(tx_buf_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rx_buf_size) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_sock_opt_t),
            "::",
            stringify!(rx_buf_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tx_buf) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_sock_opt_t),
            "::",
            stringify!(tx_buf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rx_buf) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_sock_opt_t),
            "::",
            stringify!(rx_buf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).encrypt_mode) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_sock_opt_t),
            "::",
            stringify!(encrypt_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).key) as usize - ptr as usize },
        25usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_sock_opt_t),
            "::",
            stringify!(key)
        )
    );
}
impl Default for bb_sock_opt_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "定义数传socket更新加密参数的自定义参数"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_sock_upd_enc_s {
    #[doc = "<@attention 更新加密通道是否使能加密模式"]
    pub encrypt_en: u8,
    #[doc = "<@attention 更新加密通道指定加密模式，类型为bb_sock_encrypt_mode_t"]
    pub encrypt_mode: u8,
    #[doc = "<@attention 更新加密通道指定密钥"]
    pub key: [u8; 32usize],
}
#[test]
fn bindgen_test_layout_bb_sock_upd_enc_s() {
    const UNINIT: ::std::mem::MaybeUninit<bb_sock_upd_enc_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_sock_upd_enc_s>(),
        34usize,
        concat!("Size of: ", stringify!(bb_sock_upd_enc_s))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_sock_upd_enc_s>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_sock_upd_enc_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).encrypt_en) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_sock_upd_enc_s),
            "::",
            stringify!(encrypt_en)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).encrypt_mode) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_sock_upd_enc_s),
            "::",
            stringify!(encrypt_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).key) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_sock_upd_enc_s),
            "::",
            stringify!(key)
        )
    );
}
#[doc = "定义数传socket更新加密参数的自定义参数"]
pub type bb_sock_upd_enc_t = bb_sock_upd_enc_s;
#[doc = "定义基本内存块"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bb_mem_block_t {
    #[doc = "<@note 定义内存起始地址"]
    pub addr: *mut u8,
    #[doc = "<@note 定义内存大小"]
    pub size: u32,
}
#[test]
fn bindgen_test_layout_bb_mem_block_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_mem_block_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_mem_block_t>(),
        16usize,
        concat!("Size of: ", stringify!(bb_mem_block_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_mem_block_t>(),
        8usize,
        concat!("Alignment of ", stringify!(bb_mem_block_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_mem_block_t),
            "::",
            stringify!(addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_mem_block_t),
            "::",
            stringify!(size)
        )
    );
}
impl Default for bb_mem_block_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "定义socket query操作返回的内存信息"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bb_query_mem_t {
    #[doc = "<@attention 基带SDK内以ringbuf管理RX数据，所以为减少内存拷贝，每个query操作最多返回两块基本内存块，如果第一个内存块为空（size=0），那么第二块必定为空"]
    pub block: [bb_mem_block_t; 2usize],
}
#[test]
fn bindgen_test_layout_bb_query_mem_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_query_mem_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_query_mem_t>(),
        32usize,
        concat!("Size of: ", stringify!(bb_query_mem_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_query_mem_t>(),
        8usize,
        concat!("Alignment of ", stringify!(bb_query_mem_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).block) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_query_mem_t),
            "::",
            stringify!(block)
        )
    );
}
impl Default for bb_query_mem_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "定义通用事件回调接口函数"]
pub type bb_event_callback = ::std::option::Option<
    unsafe extern "C" fn(arg: *mut ::std::os::raw::c_void, user: *mut ::std::os::raw::c_void),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uart_list_hd {
    pub num: u32,
    pub uart_dev_name: [::std::os::raw::c_char; 1000usize],
}
#[test]
fn bindgen_test_layout_uart_list_hd() {
    const UNINIT: ::std::mem::MaybeUninit<uart_list_hd> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uart_list_hd>(),
        1004usize,
        concat!("Size of: ", stringify!(uart_list_hd))
    );
    assert_eq!(
        ::std::mem::align_of::<uart_list_hd>(),
        4usize,
        concat!("Alignment of ", stringify!(uart_list_hd))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uart_list_hd),
            "::",
            stringify!(num)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uart_dev_name) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(uart_list_hd),
            "::",
            stringify!(uart_dev_name)
        )
    );
}
impl Default for uart_list_hd {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct uart_par {
    pub BaudRate: ::std::os::raw::c_int,
    pub ByteSize: ::std::os::raw::c_int,
    pub Parity: ::std::os::raw::c_int,
    pub StopBits: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_uart_par() {
    const UNINIT: ::std::mem::MaybeUninit<uart_par> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uart_par>(),
        16usize,
        concat!("Size of: ", stringify!(uart_par))
    );
    assert_eq!(
        ::std::mem::align_of::<uart_par>(),
        4usize,
        concat!("Alignment of ", stringify!(uart_par))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BaudRate) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uart_par),
            "::",
            stringify!(BaudRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ByteSize) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(uart_par),
            "::",
            stringify!(ByteSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Parity) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uart_par),
            "::",
            stringify!(Parity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).StopBits) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(uart_par),
            "::",
            stringify!(StopBits)
        )
    );
}
pub const uart_msg_uart_add_ok: uart_msg = 0;
pub const uart_msg_uart_open_fail: uart_msg = 1;
pub const uart_msg_uart_had_added: uart_msg = 2;
pub type uart_msg = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct uart_ioctl {
    pub uart_dev_name: [::std::os::raw::c_char; 24usize],
    pub par: uart_par,
}
#[test]
fn bindgen_test_layout_uart_ioctl() {
    const UNINIT: ::std::mem::MaybeUninit<uart_ioctl> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uart_ioctl>(),
        40usize,
        concat!("Size of: ", stringify!(uart_ioctl))
    );
    assert_eq!(
        ::std::mem::align_of::<uart_ioctl>(),
        4usize,
        concat!("Alignment of ", stringify!(uart_ioctl))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uart_dev_name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uart_ioctl),
            "::",
            stringify!(uart_dev_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).par) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(uart_ioctl),
            "::",
            stringify!(par)
        )
    );
}
#[doc = "定义socket加密头部"]
#[repr(C, packed)]
pub struct bb_socket_encrypt_hdr_t {
    #[doc = "<<@note 魔数: 0x80 0x30"]
    pub magic: [u8; 2usize],
    #[doc = "<<@note 头部版本"]
    pub ver: u8,
    #[doc = "<<@note 加密算法"]
    pub algo: u8,
    #[doc = "<<@note 加密模式"]
    pub mode: u8,
    #[doc = "<<@note 负载长度(来自头部)"]
    pub len: u16,
    #[doc = "<<@note AES/DES初始向量"]
    pub iv: [u8; 16usize],
    #[doc = "<<@note 头部CRC校验"]
    pub hdr_crc: u16,
    #[doc = "<<@note 保留字段"]
    pub rsv: [u8; 3usize],
    #[doc = "<<@note 加密负载数据"]
    pub data: __IncompleteArrayField<u8>,
}
#[test]
fn bindgen_test_layout_bb_socket_encrypt_hdr_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_socket_encrypt_hdr_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_socket_encrypt_hdr_t>(),
        28usize,
        concat!("Size of: ", stringify!(bb_socket_encrypt_hdr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_socket_encrypt_hdr_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_socket_encrypt_hdr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).magic) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_socket_encrypt_hdr_t),
            "::",
            stringify!(magic)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ver) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_socket_encrypt_hdr_t),
            "::",
            stringify!(ver)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).algo) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_socket_encrypt_hdr_t),
            "::",
            stringify!(algo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mode) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_socket_encrypt_hdr_t),
            "::",
            stringify!(mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).len) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_socket_encrypt_hdr_t),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iv) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_socket_encrypt_hdr_t),
            "::",
            stringify!(iv)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hdr_crc) as usize - ptr as usize },
        23usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_socket_encrypt_hdr_t),
            "::",
            stringify!(hdr_crc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rsv) as usize - ptr as usize },
        25usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_socket_encrypt_hdr_t),
            "::",
            stringify!(rsv)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_socket_encrypt_hdr_t),
            "::",
            stringify!(data)
        )
    );
}
impl Default for bb_socket_encrypt_hdr_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bb_dev_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bb_dev_handle_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bb_host_t {
    _unused: [u8; 0],
}
pub type bb_dev_list_t = *mut bb_dev_t;
#[doc = "定义配置命令BB_CFG_AP_BASIC的输入参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_conf_ap_t {
    #[doc = "<@note AP自己的MAC"]
    pub ap_mac: bb_mac_t,
    #[doc = "<@note 基带工作频率 类型：bb_clk_sel_e"]
    pub clock: u8,
    #[doc = "<@note 初始MCS等级 类型：bb_phy_mcs_e"]
    pub init_mcs: u8,
    #[doc = "<@note 发送无线质量给对端"]
    pub sq_report: u8,
    #[doc = "<@note 基带工作模式 类型：bb_mode_e"]
    pub bb_mode: u8,
    #[doc = "<@note slot工作模式，1V1模式本字段无效 类型：bb_slot_mode_e"]
    pub slot_mode: u8,
    #[doc = "<@note 有效slot的bitmap，1V1模式本字段无效"]
    pub slot_bmp: u8,
    #[doc = "<@note 压缩BR模式，仅1V1模式有效 类型：布尔"]
    pub compact_br: u8,
    #[doc = "<@note 天线数量"]
    pub ant_num: u8,
}
#[test]
fn bindgen_test_layout_bb_conf_ap_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_conf_ap_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_conf_ap_t>(),
        12usize,
        concat!("Size of: ", stringify!(bb_conf_ap_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_conf_ap_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_conf_ap_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ap_mac) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_ap_t),
            "::",
            stringify!(ap_mac)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).clock) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_ap_t),
            "::",
            stringify!(clock)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).init_mcs) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_ap_t),
            "::",
            stringify!(init_mcs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sq_report) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_ap_t),
            "::",
            stringify!(sq_report)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bb_mode) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_ap_t),
            "::",
            stringify!(bb_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).slot_mode) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_ap_t),
            "::",
            stringify!(slot_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).slot_bmp) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_ap_t),
            "::",
            stringify!(slot_bmp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).compact_br) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_ap_t),
            "::",
            stringify!(compact_br)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ant_num) as usize - ptr as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_ap_t),
            "::",
            stringify!(ant_num)
        )
    );
}
#[doc = "定义配置命令BB_CFG_DEV_BASIC的输入参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_conf_dev_t {
    #[doc = "<@note AP的MAC，即目标接入点ID"]
    pub ap_mac: bb_mac_t,
    #[doc = "<@note 基带工作频率 类型：bb_clk_sel_e"]
    pub clock: u8,
    #[doc = "<@note 初始MCS等级 类型：bb_phy_mcs_e"]
    pub init_mcs: u8,
    #[doc = "<@note 发送无线质量给对端"]
    pub sq_report: u8,
    #[doc = "<@note 天线数量"]
    pub ant_num: u8,
    #[doc = "<@note DEV自己的MAC"]
    pub dev_mac: bb_mac_t,
}
#[test]
fn bindgen_test_layout_bb_conf_dev_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_conf_dev_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_conf_dev_t>(),
        12usize,
        concat!("Size of: ", stringify!(bb_conf_dev_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_conf_dev_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_conf_dev_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ap_mac) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_dev_t),
            "::",
            stringify!(ap_mac)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).clock) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_dev_t),
            "::",
            stringify!(clock)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).init_mcs) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_dev_t),
            "::",
            stringify!(init_mcs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sq_report) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_dev_t),
            "::",
            stringify!(sq_report)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ant_num) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_dev_t),
            "::",
            stringify!(ant_num)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dev_mac) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_dev_t),
            "::",
            stringify!(dev_mac)
        )
    );
}
#[doc = "定义配置命令BB_CFG_SYNC_MODE的输入参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_conf_sync_mode_t {
    #[doc = "<@note 使能同步模式"]
    pub enable: u8,
    #[doc = "<@note 同步模式中Master或Slave"]
    pub master: u8,
    #[doc = "<@note PIN GROUP 类型：AR_PIN_GROUP 注：仅AP侧有效"]
    pub pin_group: u8,
    #[doc = "<@note pin port，PIN GROUP中的port位置 注：仅AP侧有效"]
    pub pin_port: u8,
}
#[test]
fn bindgen_test_layout_bb_conf_sync_mode_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_conf_sync_mode_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_conf_sync_mode_t>(),
        4usize,
        concat!("Size of: ", stringify!(bb_conf_sync_mode_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_conf_sync_mode_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_conf_sync_mode_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enable) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_sync_mode_t),
            "::",
            stringify!(enable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).master) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_sync_mode_t),
            "::",
            stringify!(master)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pin_group) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_sync_mode_t),
            "::",
            stringify!(pin_group)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pin_port) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_sync_mode_t),
            "::",
            stringify!(pin_port)
        )
    );
}
#[doc = "定义配置命令BB_CFG_BR_HOP_POLICY的输入参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_conf_br_hop_policy_t {
    #[doc = "<@note 几毫秒跳一次频点"]
    pub time: u16,
    #[doc = "<@note BR跳频模式 bb_br_hop_mode_e"]
    pub hop_mode: u8,
    #[doc = "<@note 指定chan_freq中的频点数量"]
    pub chan_num: u8,
    #[doc = "<@note 频点表 单位：KHz"]
    pub chan_freq: [u32; 9usize],
}
#[test]
fn bindgen_test_layout_bb_conf_br_hop_policy_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_conf_br_hop_policy_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_conf_br_hop_policy_t>(),
        40usize,
        concat!("Size of: ", stringify!(bb_conf_br_hop_policy_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_conf_br_hop_policy_t>(),
        4usize,
        concat!("Alignment of ", stringify!(bb_conf_br_hop_policy_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).time) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_br_hop_policy_t),
            "::",
            stringify!(time)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hop_mode) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_br_hop_policy_t),
            "::",
            stringify!(hop_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).chan_num) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_br_hop_policy_t),
            "::",
            stringify!(chan_num)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).chan_freq) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_br_hop_policy_t),
            "::",
            stringify!(chan_freq)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bb_conf_br_hop_policy_api_t {
    pub info: bb_conf_br_hop_policy_t,
    pub rsv: [u8; 128usize],
}
#[test]
fn bindgen_test_layout_bb_conf_br_hop_policy_api_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_conf_br_hop_policy_api_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_conf_br_hop_policy_api_t>(),
        168usize,
        concat!("Size of: ", stringify!(bb_conf_br_hop_policy_api_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_conf_br_hop_policy_api_t>(),
        4usize,
        concat!("Alignment of ", stringify!(bb_conf_br_hop_policy_api_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).info) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_br_hop_policy_api_t),
            "::",
            stringify!(info)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rsv) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_br_hop_policy_api_t),
            "::",
            stringify!(rsv)
        )
    );
}
impl Default for bb_conf_br_hop_policy_api_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "定义自适应跳频的触发条件项"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_chan_hop_item_t {
    pub retx_cnt: u8,
    pub power_diff: u8,
}
#[test]
fn bindgen_test_layout_bb_chan_hop_item_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_chan_hop_item_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_chan_hop_item_t>(),
        2usize,
        concat!("Size of: ", stringify!(bb_chan_hop_item_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_chan_hop_item_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_chan_hop_item_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).retx_cnt) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_chan_hop_item_t),
            "::",
            stringify!(retx_cnt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).power_diff) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_chan_hop_item_t),
            "::",
            stringify!(power_diff)
        )
    );
}
#[doc = "定义自适应跳频触发参数"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_chan_hop_para_t {
    #[doc = "<@note 盲跳限制时间长度"]
    pub blind_hop_period: u16,
    #[doc = "<@note 触发盲跳额错误次数"]
    pub blind_hop_count: u8,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub items: [bb_chan_hop_item_t; 5usize],
}
#[test]
fn bindgen_test_layout_bb_chan_hop_para_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_chan_hop_para_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_chan_hop_para_t>(),
        14usize,
        concat!("Size of: ", stringify!(bb_chan_hop_para_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_chan_hop_para_t>(),
        2usize,
        concat!("Alignment of ", stringify!(bb_chan_hop_para_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).blind_hop_period) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_chan_hop_para_t),
            "::",
            stringify!(blind_hop_period)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).blind_hop_count) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_chan_hop_para_t),
            "::",
            stringify!(blind_hop_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).items) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_chan_hop_para_t),
            "::",
            stringify!(items)
        )
    );
}
impl bb_chan_hop_para_t {
    #[inline]
    pub fn hop_stat_win_err(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hop_stat_win_err(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn item_num(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 7u8) as u8) }
    }
    #[inline]
    pub fn set_item_num(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 7u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        hop_stat_win_err: u8,
        item_num: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let hop_stat_win_err: u8 = unsafe { ::std::mem::transmute(hop_stat_win_err) };
            hop_stat_win_err as u64
        });
        __bindgen_bitfield_unit.set(1usize, 7u8, {
            let item_num: u8 = unsafe { ::std::mem::transmute(item_num) };
            item_num as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_chan_hop_multi_para_t {
    pub retx_cnt: u8,
    pub power_diff: u8,
    pub chan_inr: u8,
}
#[test]
fn bindgen_test_layout_bb_chan_hop_multi_para_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_chan_hop_multi_para_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_chan_hop_multi_para_t>(),
        3usize,
        concat!("Size of: ", stringify!(bb_chan_hop_multi_para_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_chan_hop_multi_para_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_chan_hop_multi_para_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).retx_cnt) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_chan_hop_multi_para_t),
            "::",
            stringify!(retx_cnt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).power_diff) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_chan_hop_multi_para_t),
            "::",
            stringify!(power_diff)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).chan_inr) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_chan_hop_multi_para_t),
            "::",
            stringify!(chan_inr)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_band_hop_item_t {
    pub snr_diff: u16,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub retx: u8,
    pub snr_db_diff: f32,
}
#[test]
fn bindgen_test_layout_bb_band_hop_item_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_band_hop_item_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_band_hop_item_t>(),
        8usize,
        concat!("Size of: ", stringify!(bb_band_hop_item_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_band_hop_item_t>(),
        4usize,
        concat!("Alignment of ", stringify!(bb_band_hop_item_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).snr_diff) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_band_hop_item_t),
            "::",
            stringify!(snr_diff)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).retx) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_band_hop_item_t),
            "::",
            stringify!(retx)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).snr_db_diff) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_band_hop_item_t),
            "::",
            stringify!(snr_db_diff)
        )
    );
}
impl bb_band_hop_item_t {
    #[inline]
    pub fn rssi_diff(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_rssi_diff(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn keep_count(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_keep_count(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(rssi_diff: u8, keep_count: u8) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 4u8, {
            let rssi_diff: u8 = unsafe { ::std::mem::transmute(rssi_diff) };
            rssi_diff as u64
        });
        __bindgen_bitfield_unit.set(4usize, 4u8, {
            let keep_count: u8 = unsafe { ::std::mem::transmute(keep_count) };
            keep_count as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_auto_band_para_t {
    pub same_band_enable: u8,
    pub same_band_master: u8,
    pub snr_thred: u16,
    pub scan_count: u8,
    pub scan_inr: u8,
    pub round_inr: u8,
    pub gain_thred: u8,
    pub items: [bb_band_hop_item_t; 2usize],
}
#[test]
fn bindgen_test_layout_bb_auto_band_para_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_auto_band_para_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_auto_band_para_t>(),
        24usize,
        concat!("Size of: ", stringify!(bb_auto_band_para_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_auto_band_para_t>(),
        4usize,
        concat!("Alignment of ", stringify!(bb_auto_band_para_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).same_band_enable) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_auto_band_para_t),
            "::",
            stringify!(same_band_enable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).same_band_master) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_auto_band_para_t),
            "::",
            stringify!(same_band_master)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).snr_thred) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_auto_band_para_t),
            "::",
            stringify!(snr_thred)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).scan_count) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_auto_band_para_t),
            "::",
            stringify!(scan_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).scan_inr) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_auto_band_para_t),
            "::",
            stringify!(scan_inr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).round_inr) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_auto_band_para_t),
            "::",
            stringify!(round_inr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gain_thred) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_auto_band_para_t),
            "::",
            stringify!(gain_thred)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).items) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_auto_band_para_t),
            "::",
            stringify!(items)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_subchan_t {
    #[doc = "<@note 主频点带宽"]
    pub main_bw: u8,
    #[doc = "<@note 子频点带宽"]
    pub sub_bw: u8,
    #[doc = "<@note 子频点数"]
    pub chan_num: u8,
    #[doc = "<@note 子频点计算的起始偏移"]
    pub offset: i32,
}
#[test]
fn bindgen_test_layout_bb_subchan_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_subchan_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_subchan_t>(),
        8usize,
        concat!("Size of: ", stringify!(bb_subchan_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_subchan_t>(),
        4usize,
        concat!("Alignment of ", stringify!(bb_subchan_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).main_bw) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_subchan_t),
            "::",
            stringify!(main_bw)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sub_bw) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_subchan_t),
            "::",
            stringify!(sub_bw)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).chan_num) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_subchan_t),
            "::",
            stringify!(chan_num)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offset) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_subchan_t),
            "::",
            stringify!(offset)
        )
    );
}
#[doc = "定义配置命令BB_CFG_RC_POLICY的输入参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_conf_rc_hop_policy_t {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    #[doc = "<@note 最大的循环跳频数量 最多4个"]
    pub max_freq_num: u8,
    #[doc = "<@note 信号质量统计周期"]
    pub stat_period: u8,
    #[doc = "<@note 删除信道的错误百分比"]
    pub remove_percent: u8,
}
#[test]
fn bindgen_test_layout_bb_conf_rc_hop_policy_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_conf_rc_hop_policy_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_conf_rc_hop_policy_t>(),
        4usize,
        concat!("Size of: ", stringify!(bb_conf_rc_hop_policy_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_conf_rc_hop_policy_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_conf_rc_hop_policy_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_freq_num) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_rc_hop_policy_t),
            "::",
            stringify!(max_freq_num)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stat_period) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_rc_hop_policy_t),
            "::",
            stringify!(stat_period)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).remove_percent) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_rc_hop_policy_t),
            "::",
            stringify!(remove_percent)
        )
    );
}
impl bb_conf_rc_hop_policy_t {
    #[inline]
    pub fn enable(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_enable(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rx_role(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_rx_role(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(enable: u8, rx_role: u8) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let enable: u8 = unsafe { ::std::mem::transmute(enable) };
            enable as u64
        });
        __bindgen_bitfield_unit.set(1usize, 2u8, {
            let rx_role: u8 = unsafe { ::std::mem::transmute(rx_role) };
            rx_role as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "定义配置命令BB_CFG_CHANNEL的输入参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_conf_chan_t {
    #[doc = "<@note 频带模式 类型：bb_band_mode_e"]
    pub band_mode: u8,
    #[doc = "<@note 初始band，如果为BB_BAND_MAX，则尝试自动选频段"]
    pub init_band: u8,
    #[doc = "<@note 初始信道，如果<0，则启动ACS起机自动选频功能"]
    pub init_chan: i8,
    #[doc = "<@note 初始化选择频段时低频段底噪bonus db"]
    pub bonus_low_band: i8,
    #[doc = "<@note 初始化选择频点时边缘信道底噪bonus db"]
    pub bonus_edge_chan: i8,
    #[doc = "<@note 信道策略标志位"]
    pub flags: u8,
    #[doc = "<@note 扫频频宽     类型：bb_bandwidth_e"]
    pub fs_bw: u8,
    #[doc = "<@note 指定chan_freq中的频点数量"]
    pub chan_num: u8,
    #[doc = "<@note 频点表 单位：KHz"]
    pub chan_freq: [u32; 32usize],
    #[doc = "<@note 从机频点表，仅对主从AP模式有效"]
    pub chan_freq_slave: [u32; 32usize],
    #[doc = "<@note 子信道的配置"]
    pub subchan: bb_subchan_t,
    #[doc = "<@note 跳频条件参数"]
    pub hop_para: bb_chan_hop_para_t,
    #[doc = "<@note 多套模式跳频参数"]
    pub hop_para_multi: bb_chan_hop_multi_para_t,
    #[doc = "<@note 频段自适应参数"]
    pub auto_band_para: bb_auto_band_para_t,
}
#[test]
fn bindgen_test_layout_bb_conf_chan_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_conf_chan_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_conf_chan_t>(),
        316usize,
        concat!("Size of: ", stringify!(bb_conf_chan_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_conf_chan_t>(),
        4usize,
        concat!("Alignment of ", stringify!(bb_conf_chan_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).band_mode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_chan_t),
            "::",
            stringify!(band_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).init_band) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_chan_t),
            "::",
            stringify!(init_band)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).init_chan) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_chan_t),
            "::",
            stringify!(init_chan)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bonus_low_band) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_chan_t),
            "::",
            stringify!(bonus_low_band)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bonus_edge_chan) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_chan_t),
            "::",
            stringify!(bonus_edge_chan)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_chan_t),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fs_bw) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_chan_t),
            "::",
            stringify!(fs_bw)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).chan_num) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_chan_t),
            "::",
            stringify!(chan_num)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).chan_freq) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_chan_t),
            "::",
            stringify!(chan_freq)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).chan_freq_slave) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_chan_t),
            "::",
            stringify!(chan_freq_slave)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).subchan) as usize - ptr as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_chan_t),
            "::",
            stringify!(subchan)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hop_para) as usize - ptr as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_chan_t),
            "::",
            stringify!(hop_para)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hop_para_multi) as usize - ptr as usize },
        286usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_chan_t),
            "::",
            stringify!(hop_para_multi)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).auto_band_para) as usize - ptr as usize },
        292usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_chan_t),
            "::",
            stringify!(auto_band_para)
        )
    );
}
#[doc = "定义频率范围的通用结构体"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_freq_range_t {
    #[doc = "<@note 最低频率值"]
    pub freq_low: u32,
    #[doc = "<@note 最高频率值"]
    pub freq_high: u32,
}
#[test]
fn bindgen_test_layout_bb_freq_range_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_freq_range_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_freq_range_t>(),
        8usize,
        concat!("Size of: ", stringify!(bb_freq_range_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_freq_range_t>(),
        4usize,
        concat!("Alignment of ", stringify!(bb_freq_range_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).freq_low) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_freq_range_t),
            "::",
            stringify!(freq_low)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).freq_high) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_freq_range_t),
            "::",
            stringify!(freq_high)
        )
    );
}
#[doc = "定义配置命令BB_CFG_CANDIDATES的输入参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_conf_candidates_t {
    #[doc = "<@note 接入候选人配置，当slot>=BB_SLOT_MAX表示不固定slot位置，类型：bb_slot_e"]
    pub slot: u8,
    #[doc = "<@note 指定mac_tab中MAC的数量"]
    pub mac_num: u8,
    #[doc = "<@note MAC表"]
    pub mac_tab: [bb_mac_t; 5usize],
}
#[test]
fn bindgen_test_layout_bb_conf_candidates_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_conf_candidates_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_conf_candidates_t>(),
        22usize,
        concat!("Size of: ", stringify!(bb_conf_candidates_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_conf_candidates_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_conf_candidates_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).slot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_candidates_t),
            "::",
            stringify!(slot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mac_num) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_candidates_t),
            "::",
            stringify!(mac_num)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mac_tab) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_candidates_t),
            "::",
            stringify!(mac_tab)
        )
    );
}
#[doc = "定义物理用户单向基带参数"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_user_para_t {
    pub payload: u8,
    #[doc = "@<note 是否有payload，如果没有payload，下面的交织配置被忽略 类型：bb_payload_e"]
    pub fch_info_len: u8,
    #[doc = "<@note 是否使能时域交织 类型：bb_timeintlv_enable_e"]
    pub tintlv_enable: u8,
    #[doc = "<@note 交织数量 类型：bb_timeintlv_num_e"]
    pub tintlv_num: u8,
    #[doc = "<@note 交织块OFDM数量 类型：bb_timeintlv_len_e"]
    pub tintlv_len: u8,
    #[doc = "<@note 用户的TX模式 类型：bb_tx_mode_e"]
    pub tx_mode: u8,
    #[doc = "<@note 用户的RX模式 类型：bb_rx_mode_e"]
    pub rx_mode: u8,
    #[doc = "<@note 频宽 类型：bb_bandwidth_e"]
    pub bandwidth: u8,
    #[doc = "<@note 重传到对次数 < 0: 重传到对           0 ~ 15：重传次数"]
    pub retx_count: i8,
    #[doc = "<@note 预编码参考位置 0为本单元，-1为前一个单元，1为后一个单元"]
    pub pre_enc_ref: i8,
    #[doc = "<@note 预编码start pointer 0 ~ 7 / 8"]
    pub pre_enc_sp: u8,
}
#[test]
fn bindgen_test_layout_bb_user_para_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_user_para_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_user_para_t>(),
        11usize,
        concat!("Size of: ", stringify!(bb_user_para_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_user_para_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_user_para_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).payload) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_user_para_t),
            "::",
            stringify!(payload)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fch_info_len) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_user_para_t),
            "::",
            stringify!(fch_info_len)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tintlv_enable) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_user_para_t),
            "::",
            stringify!(tintlv_enable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tintlv_num) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_user_para_t),
            "::",
            stringify!(tintlv_num)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tintlv_len) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_user_para_t),
            "::",
            stringify!(tintlv_len)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tx_mode) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_user_para_t),
            "::",
            stringify!(tx_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rx_mode) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_user_para_t),
            "::",
            stringify!(rx_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bandwidth) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_user_para_t),
            "::",
            stringify!(bandwidth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).retx_count) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_user_para_t),
            "::",
            stringify!(retx_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pre_enc_ref) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_user_para_t),
            "::",
            stringify!(pre_enc_ref)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pre_enc_sp) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_user_para_t),
            "::",
            stringify!(pre_enc_sp)
        )
    );
}
#[doc = "定义配置命令BB_CFG_USER_PARA的输入参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_conf_user_para_t {
    #[doc = "<@note 基带物理用户 类型：bb_user_e"]
    pub user: u8,
    #[doc = "<@note 基带物理用户TX参数 忽略内部rx_mode字段"]
    pub tx_para: bb_user_para_t,
    #[doc = "<@note 基带物理用户RX参数 忽略内部tx_mode字段 pre_enc_ref和prec_enc_sp字段"]
    pub rx_para: bb_user_para_t,
}
#[test]
fn bindgen_test_layout_bb_conf_user_para_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_conf_user_para_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_conf_user_para_t>(),
        23usize,
        concat!("Size of: ", stringify!(bb_conf_user_para_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_conf_user_para_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_conf_user_para_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).user) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_user_para_t),
            "::",
            stringify!(user)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tx_para) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_user_para_t),
            "::",
            stringify!(tx_para)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rx_para) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_user_para_t),
            "::",
            stringify!(rx_para)
        )
    );
}
#[doc = "定义MCS策略条目结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_mcs_para_t {
    #[doc = "<@note MCS等级 类型：bb_phy_mcs_e"]
    pub mcs: u8,
    #[doc = "<@note 进入本级MCS所应大于等于的SNR线性值"]
    pub snr_up: u16,
    #[doc = "<@note 退出本级MCS所应低于的SNR线性值"]
    pub snr_dw: u16,
    #[doc = "<@note 进入本级MCS所应小于等于的LDPC错误点数"]
    pub ldpc_up_num: u8,
    #[doc = "<@note 退出本级MCS所应大于的LDPC错误点数"]
    pub ldpc_dw_num: u8,
    #[doc = "<@note 进入本级MCS，SNR和LDPC条件需保持的时间长度 单位：毫秒"]
    pub up_keep_time: u16,
    #[doc = "<@note 退出本级MCS，SNR和LDPC条件需保持的时间长度 单位：毫秒"]
    pub dw_keep_time: u16,
}
#[test]
fn bindgen_test_layout_bb_mcs_para_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_mcs_para_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_mcs_para_t>(),
        12usize,
        concat!("Size of: ", stringify!(bb_mcs_para_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_mcs_para_t>(),
        2usize,
        concat!("Alignment of ", stringify!(bb_mcs_para_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mcs) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_mcs_para_t),
            "::",
            stringify!(mcs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).snr_up) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_mcs_para_t),
            "::",
            stringify!(snr_up)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).snr_dw) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_mcs_para_t),
            "::",
            stringify!(snr_dw)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ldpc_up_num) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_mcs_para_t),
            "::",
            stringify!(ldpc_up_num)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ldpc_dw_num) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_mcs_para_t),
            "::",
            stringify!(ldpc_dw_num)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).up_keep_time) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_mcs_para_t),
            "::",
            stringify!(up_keep_time)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dw_keep_time) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_mcs_para_t),
            "::",
            stringify!(dw_keep_time)
        )
    );
}
#[doc = "定义auto bw的参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_bw_auto_para_t {
    #[doc = "<@note 使能频宽自适应 1：使能 0：禁用"]
    pub enable: u8,
    #[doc = "<@note 频宽自适应最低挡 类型：bb_bandwidth_e"]
    pub bw_low: u8,
    #[doc = "<@note 频宽自适应最高挡 类型：bb_bandwidth_e"]
    pub bw_high: u8,
    #[doc = "<@note 触发降频宽的mcs挡位 类型：bb_phy_mcs_e"]
    pub thred_dw: u8,
    #[doc = "<@note 触发升频宽的mcs挡位 类型：bb_phy_mcs_e"]
    pub thred_up: u8,
}
#[test]
fn bindgen_test_layout_bb_bw_auto_para_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_bw_auto_para_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_bw_auto_para_t>(),
        5usize,
        concat!("Size of: ", stringify!(bb_bw_auto_para_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_bw_auto_para_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_bw_auto_para_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enable) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_bw_auto_para_t),
            "::",
            stringify!(enable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bw_low) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_bw_auto_para_t),
            "::",
            stringify!(bw_low)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bw_high) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_bw_auto_para_t),
            "::",
            stringify!(bw_high)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).thred_dw) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_bw_auto_para_t),
            "::",
            stringify!(thred_dw)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).thred_up) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_bw_auto_para_t),
            "::",
            stringify!(thred_up)
        )
    );
}
#[doc = "定义配置命令BB_CFG_SLOT_RX_MCS的输入参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_conf_mcs_t {
    #[doc = "<@note MCS策略使用位置 类型：bb_slot_e"]
    pub slot: u8,
    #[doc = "<@note MCS策略标志位"]
    pub flags: u8,
    #[doc = "<@note MCS延迟启动计数"]
    pub delay_start: u16,
    #[doc = "<@note MCS切换后需要保持的时间"]
    pub hold_time: u16,
    #[doc = "<@attention 初始MCS等级，如果>=BB_PHY_MCS_MAX那么，SDK根据接入时的SNR检测，选择一个合适的MCS级别 类型：bb_phy_mcs_e"]
    pub init_mcs: u8,
    #[doc = "<@note MCS级别数量"]
    pub mcs_num: u8,
    #[doc = "<@note 最多堵塞多长时间后放行"]
    pub max_wait_time: u16,
    #[doc = "<@note MCS自动切换策略bb_mcs_auto_mode_policy_e"]
    pub mcs_auto_mode_policy: u8,
    pub rsv: u8,
    #[doc = "<@note MCS级别表"]
    pub mcs_tab: [bb_mcs_para_t; 16usize],
    pub bw_auto: bb_bw_auto_para_t,
}
#[test]
fn bindgen_test_layout_bb_conf_mcs_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_conf_mcs_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_conf_mcs_t>(),
        210usize,
        concat!("Size of: ", stringify!(bb_conf_mcs_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_conf_mcs_t>(),
        2usize,
        concat!("Alignment of ", stringify!(bb_conf_mcs_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).slot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_mcs_t),
            "::",
            stringify!(slot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_mcs_t),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).delay_start) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_mcs_t),
            "::",
            stringify!(delay_start)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hold_time) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_mcs_t),
            "::",
            stringify!(hold_time)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).init_mcs) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_mcs_t),
            "::",
            stringify!(init_mcs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mcs_num) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_mcs_t),
            "::",
            stringify!(mcs_num)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_wait_time) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_mcs_t),
            "::",
            stringify!(max_wait_time)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mcs_auto_mode_policy) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_mcs_t),
            "::",
            stringify!(mcs_auto_mode_policy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rsv) as usize - ptr as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_mcs_t),
            "::",
            stringify!(rsv)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mcs_tab) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_mcs_t),
            "::",
            stringify!(mcs_tab)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bw_auto) as usize - ptr as usize },
        204usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_mcs_t),
            "::",
            stringify!(bw_auto)
        )
    );
}
#[doc = "定义配置命令BB_CFG_DISTC的输入参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_conf_distc_t {
    #[doc = "<@note 是否使能测距功能"]
    pub enable: u8,
    #[doc = "<@note 平均窗口大小，本参数2^n参数，n=0~3"]
    pub window: u8,
    #[doc = "<@note 超时阈值 2.6*(n+1)ms n=0~63"]
    pub timeout: u8,
    #[doc = "<@note 测距校准值，即在近距离时基带td_out的输出值，此值用于在测距输出时进行基值扣除"]
    pub offset: u32,
}
#[test]
fn bindgen_test_layout_bb_conf_distc_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_conf_distc_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_conf_distc_t>(),
        8usize,
        concat!("Size of: ", stringify!(bb_conf_distc_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_conf_distc_t>(),
        4usize,
        concat!("Alignment of ", stringify!(bb_conf_distc_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enable) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_distc_t),
            "::",
            stringify!(enable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).window) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_distc_t),
            "::",
            stringify!(window)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timeout) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_distc_t),
            "::",
            stringify!(timeout)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offset) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_distc_t),
            "::",
            stringify!(offset)
        )
    );
}
#[doc = "定义配置命令BB_CFG_PWR_BASIC的输入参数结构"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bb_phy_pwr_basic_t {
    #[doc = "<@note 功率开闭环模式"]
    pub pwr_mode: bb_phy_pwr_mode_e,
    #[doc = "<@note 功率初始值"]
    pub pwr_init: u8,
    #[doc = "<@note 功率自适应开关"]
    pub pwr_auto: u8,
    #[doc = "<@note 功率自适应打开时，功率区间最小值"]
    pub pwr_min: u8,
    #[doc = "<@note 功率自适应打开时，功率区间最大值，当功率自适应关闭时，为系统功率初始值"]
    pub pwr_max: u8,
}
#[test]
fn bindgen_test_layout_bb_phy_pwr_basic_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_phy_pwr_basic_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_phy_pwr_basic_t>(),
        8usize,
        concat!("Size of: ", stringify!(bb_phy_pwr_basic_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_phy_pwr_basic_t>(),
        4usize,
        concat!("Alignment of ", stringify!(bb_phy_pwr_basic_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pwr_mode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_phy_pwr_basic_t),
            "::",
            stringify!(pwr_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pwr_init) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_phy_pwr_basic_t),
            "::",
            stringify!(pwr_init)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pwr_auto) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_phy_pwr_basic_t),
            "::",
            stringify!(pwr_auto)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pwr_min) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_phy_pwr_basic_t),
            "::",
            stringify!(pwr_min)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pwr_max) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_phy_pwr_basic_t),
            "::",
            stringify!(pwr_max)
        )
    );
}
impl Default for bb_phy_pwr_basic_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "定义配置命令BB_CFG_PWR_BASIC_EX的输入参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_phy_pwr_basic_ex_t {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[test]
fn bindgen_test_layout_bb_phy_pwr_basic_ex_t() {
    assert_eq!(
        ::std::mem::size_of::<bb_phy_pwr_basic_ex_t>(),
        4usize,
        concat!("Size of: ", stringify!(bb_phy_pwr_basic_ex_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_phy_pwr_basic_ex_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_phy_pwr_basic_ex_t))
    );
}
impl bb_phy_pwr_basic_ex_t {
    #[inline]
    pub fn link_auto(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_link_auto(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn auto_reset(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 5u8) as u8) }
    }
    #[inline]
    pub fn set_auto_reset(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn manu_init(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 5u8) as u8) }
    }
    #[inline]
    pub fn set_manu_init(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn manu_reset(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 5u8) as u8) }
    }
    #[inline]
    pub fn set_manu_reset(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn csma_offset(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(24usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_csma_offset(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(24usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        link_auto: u8,
        auto_reset: u8,
        manu_init: u8,
        manu_reset: u8,
        csma_offset: u8,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let link_auto: u8 = unsafe { ::std::mem::transmute(link_auto) };
            link_auto as u64
        });
        __bindgen_bitfield_unit.set(1usize, 5u8, {
            let auto_reset: u8 = unsafe { ::std::mem::transmute(auto_reset) };
            auto_reset as u64
        });
        __bindgen_bitfield_unit.set(8usize, 5u8, {
            let manu_init: u8 = unsafe { ::std::mem::transmute(manu_init) };
            manu_init as u64
        });
        __bindgen_bitfield_unit.set(16usize, 5u8, {
            let manu_reset: u8 = unsafe { ::std::mem::transmute(manu_reset) };
            manu_reset as u64
        });
        __bindgen_bitfield_unit.set(24usize, 4u8, {
            let csma_offset: u8 = unsafe { ::std::mem::transmute(csma_offset) };
            csma_offset as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_auto_power_save_t {
    #[doc = "<@note 吞吐率提升门限 百分比"]
    pub up_thred: u8,
    #[doc = "<@note 吞吐率降低门限 百分比"]
    pub dw_thred: u8,
    #[doc = "<@note 保持的帧周期计数"]
    pub keep_count: u8,
    #[doc = "<@note 最大发送周期"]
    pub period_max: u8,
}
#[test]
fn bindgen_test_layout_bb_auto_power_save_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_auto_power_save_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_auto_power_save_t>(),
        4usize,
        concat!("Size of: ", stringify!(bb_auto_power_save_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_auto_power_save_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_auto_power_save_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).up_thred) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_auto_power_save_t),
            "::",
            stringify!(up_thred)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dw_thred) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_auto_power_save_t),
            "::",
            stringify!(dw_thred)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).keep_count) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_auto_power_save_t),
            "::",
            stringify!(keep_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).period_max) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_auto_power_save_t),
            "::",
            stringify!(period_max)
        )
    );
}
#[doc = "定义配置命令BB_CFG_POWER_SAVE的输入参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_conf_power_save_t {
    #[doc = "<@note 节能主控端 类型：bb_role_e"]
    pub master: u8,
    #[doc = "<@note 1=自动模式 0=手动模式"]
    pub flags: u8,
    #[doc = "<@note 手动模式固定周期"]
    pub period_fix: u8,
    #[doc = "<@note 自动模式策略"]
    pub auto_policy: bb_auto_power_save_t,
}
#[test]
fn bindgen_test_layout_bb_conf_power_save_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_conf_power_save_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_conf_power_save_t>(),
        7usize,
        concat!("Size of: ", stringify!(bb_conf_power_save_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_conf_power_save_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_conf_power_save_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).master) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_power_save_t),
            "::",
            stringify!(master)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_power_save_t),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).period_fix) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_power_save_t),
            "::",
            stringify!(period_fix)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).auto_policy) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_power_save_t),
            "::",
            stringify!(auto_policy)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_auto_rf_policy_t {
    #[doc = "<@note <=该MCS时打开B路"]
    pub on_snr: u16,
    #[doc = "<@note >=该MCS时关闭B路"]
    pub off_snr: u16,
    #[doc = "<@note 打开B路时需保持的豪秒数"]
    pub on_keep: u16,
    #[doc = "<@note 关闭B路时需保持的豪秒数"]
    pub off_keep: u16,
}
#[test]
fn bindgen_test_layout_bb_auto_rf_policy_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_auto_rf_policy_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_auto_rf_policy_t>(),
        8usize,
        concat!("Size of: ", stringify!(bb_auto_rf_policy_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_auto_rf_policy_t>(),
        2usize,
        concat!("Alignment of ", stringify!(bb_auto_rf_policy_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).on_snr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_auto_rf_policy_t),
            "::",
            stringify!(on_snr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).off_snr) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_auto_rf_policy_t),
            "::",
            stringify!(off_snr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).on_keep) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_auto_rf_policy_t),
            "::",
            stringify!(on_keep)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).off_keep) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_auto_rf_policy_t),
            "::",
            stringify!(off_keep)
        )
    );
}
#[doc = "定义配置命令BB_CFG_RF_POLICY的输入参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_conf_rf_policy_t {
    #[doc = "<@note 1=自动模式 0=手动模式"]
    pub flags: u8,
    #[doc = "<@note 1=固定开启B路 0=固定关闭B路"]
    pub state_fix: u8,
    #[doc = "<@note 自动模式策略"]
    pub auto_policy: bb_auto_rf_policy_t,
}
#[test]
fn bindgen_test_layout_bb_conf_rf_policy_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_conf_rf_policy_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_conf_rf_policy_t>(),
        10usize,
        concat!("Size of: ", stringify!(bb_conf_rf_policy_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_conf_rf_policy_t>(),
        2usize,
        concat!("Alignment of ", stringify!(bb_conf_rf_policy_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_rf_policy_t),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).state_fix) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_rf_policy_t),
            "::",
            stringify!(state_fix)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).auto_policy) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_rf_policy_t),
            "::",
            stringify!(auto_policy)
        )
    );
}
#[doc = "定义配置命令BB_CFG_AGC的输入参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_conf_agc_t {
    pub agc_gain: u8,
    pub agc_gain_offset: i8,
    pub gain_offset: i8,
}
#[test]
fn bindgen_test_layout_bb_conf_agc_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_conf_agc_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_conf_agc_t>(),
        3usize,
        concat!("Size of: ", stringify!(bb_conf_agc_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_conf_agc_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_conf_agc_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).agc_gain) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_agc_t),
            "::",
            stringify!(agc_gain)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).agc_gain_offset) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_agc_t),
            "::",
            stringify!(agc_gain_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gain_offset) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_agc_t),
            "::",
            stringify!(gain_offset)
        )
    );
}
#[doc = "定义配置命令BB_CFG_GAIN的输入参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_conf_gain_t {
    pub gain_a_offset_low: i8,
    pub gain_b_offset_low: i8,
    pub gain_a_offset_high: i8,
    pub gain_b_offset_high: i8,
    pub gain_a_thres: i8,
    pub gain_b_thres: i8,
}
#[test]
fn bindgen_test_layout_bb_conf_gain_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_conf_gain_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_conf_gain_t>(),
        6usize,
        concat!("Size of: ", stringify!(bb_conf_gain_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_conf_gain_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_conf_gain_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gain_a_offset_low) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_gain_t),
            "::",
            stringify!(gain_a_offset_low)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gain_b_offset_low) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_gain_t),
            "::",
            stringify!(gain_b_offset_low)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gain_a_offset_high) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_gain_t),
            "::",
            stringify!(gain_a_offset_high)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gain_b_offset_high) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_gain_t),
            "::",
            stringify!(gain_b_offset_high)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gain_a_thres) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_gain_t),
            "::",
            stringify!(gain_a_thres)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gain_b_thres) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_conf_gain_t),
            "::",
            stringify!(gain_b_thres)
        )
    );
}
#[doc = "定义配置命令BB_CFG_RF_CALI的输入参数结构"]
pub type bb_conf_rf_cali_t = [u8; 3usize];
#[doc = "定义物理状态"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_phy_status_t {
    #[doc = "<@attention MCS级别 注意：如果是RX端此字段无意义，应该从link status中获取 类型：bb_phy_mcs_e"]
    pub mcs: u8,
    #[doc = "<@attention TX和RX模式，用户根据所在是RX参数或TX参数来决定值的意义 类型：bb_tx_mode_e或bb_rx_mode_e"]
    pub rf_mode: u8,
    #[doc = "<@note 是否进行时域交织 类型：bb_timeintlv_enable_e"]
    pub tintlv_enable: u8,
    #[doc = "<@note 交织块数量 类型：bb_timeintlv_num_e"]
    pub tintlv_num: u8,
    #[doc = "<@note 交织块OFDM数量 类型：bb_timeintlv_len_e"]
    pub tintlv_len: u8,
    #[doc = "<@note 频宽 类型：bb_bandwidth_e"]
    pub bandwidth: u8,
    #[doc = "<@note 频点 单位：KHz"]
    pub freq_khz: u32,
}
#[test]
fn bindgen_test_layout_bb_phy_status_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_phy_status_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_phy_status_t>(),
        12usize,
        concat!("Size of: ", stringify!(bb_phy_status_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_phy_status_t>(),
        4usize,
        concat!("Alignment of ", stringify!(bb_phy_status_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mcs) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_phy_status_t),
            "::",
            stringify!(mcs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rf_mode) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_phy_status_t),
            "::",
            stringify!(rf_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tintlv_enable) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_phy_status_t),
            "::",
            stringify!(tintlv_enable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tintlv_num) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_phy_status_t),
            "::",
            stringify!(tintlv_num)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tintlv_len) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_phy_status_t),
            "::",
            stringify!(tintlv_len)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bandwidth) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_phy_status_t),
            "::",
            stringify!(bandwidth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).freq_khz) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_phy_status_t),
            "::",
            stringify!(freq_khz)
        )
    );
}
#[doc = "定义链路状态"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_link_status_t {
    #[doc = "<@note 链路层状态 类型：bb_link_state_e"]
    pub state: u8,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    #[doc = "<@note 对端MAC"]
    pub peer_mac: bb_mac_t,
}
#[test]
fn bindgen_test_layout_bb_link_status_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_link_status_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_link_status_t>(),
        6usize,
        concat!("Size of: ", stringify!(bb_link_status_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_link_status_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_link_status_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).state) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_link_status_t),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).peer_mac) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_link_status_t),
            "::",
            stringify!(peer_mac)
        )
    );
}
impl bb_link_status_t {
    #[inline]
    pub fn rx_mcs(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 5u8) as u8) }
    }
    #[inline]
    pub fn set_rx_mcs(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn pair_state(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_pair_state(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn padding(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_padding(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        rx_mcs: u8,
        pair_state: u8,
        padding: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 5u8, {
            let rx_mcs: u8 = unsafe { ::std::mem::transmute(rx_mcs) };
            rx_mcs as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let pair_state: u8 = unsafe { ::std::mem::transmute(pair_state) };
            pair_state as u64
        });
        __bindgen_bitfield_unit.set(6usize, 2u8, {
            let padding: u8 = unsafe { ::std::mem::transmute(padding) };
            padding as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "定义用户的状态结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_user_status_t {
    #[doc = "<@note 物理层发送侧状态"]
    pub tx_status: bb_phy_status_t,
    #[doc = "<@note 物理层接收侧状态"]
    pub rx_status: bb_phy_status_t,
}
#[test]
fn bindgen_test_layout_bb_user_status_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_user_status_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_user_status_t>(),
        24usize,
        concat!("Size of: ", stringify!(bb_user_status_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_user_status_t>(),
        4usize,
        concat!("Alignment of ", stringify!(bb_user_status_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tx_status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_user_status_t),
            "::",
            stringify!(tx_status)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rx_status) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_user_status_t),
            "::",
            stringify!(rx_status)
        )
    );
}
#[doc = "定义读取命令BB_GET_STATUS的输出参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_get_status_out_t {
    #[doc = "<@note 设备角色 类型：bb_role_e"]
    pub role: u8,
    #[doc = "<@note 基带模式 类型：bb_mode_e"]
    pub mode: u8,
    #[doc = "<@note 芯片同步模式 1: 使能 0：不使能"]
    pub sync_mode: u8,
    #[doc = "<@note 同步模式中身份 1：   master      0：slave"]
    pub sync_master: u8,
    #[doc = "<@note 配置的SLOT的bitmap"]
    pub cfg_sbmp: u8,
    #[doc = "<@note 运行时SLOT的bitmap"]
    pub rt_sbmp: u8,
    #[doc = "<@note 本机的MAC地址"]
    pub mac: bb_mac_t,
    #[doc = "<@note 物理用户状态"]
    pub user_status: [bb_user_status_t; 10usize],
    #[doc = "<@note 链路状态"]
    pub link_status: [bb_link_status_t; 8usize],
}
#[test]
fn bindgen_test_layout_bb_get_status_out_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_get_status_out_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_get_status_out_t>(),
        300usize,
        concat!("Size of: ", stringify!(bb_get_status_out_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_get_status_out_t>(),
        4usize,
        concat!("Alignment of ", stringify!(bb_get_status_out_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).role) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_status_out_t),
            "::",
            stringify!(role)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mode) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_status_out_t),
            "::",
            stringify!(mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sync_mode) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_status_out_t),
            "::",
            stringify!(sync_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sync_master) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_status_out_t),
            "::",
            stringify!(sync_master)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cfg_sbmp) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_status_out_t),
            "::",
            stringify!(cfg_sbmp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rt_sbmp) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_status_out_t),
            "::",
            stringify!(rt_sbmp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mac) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_status_out_t),
            "::",
            stringify!(mac)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).user_status) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_status_out_t),
            "::",
            stringify!(user_status)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).link_status) as usize - ptr as usize },
        252usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_status_out_t),
            "::",
            stringify!(link_status)
        )
    );
}
#[doc = "定义读取命令BB_GET_STATUS的输入参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_get_status_in_t {
    #[doc = "<@attention 需要获取的物理用户的bitmap，如果不关注物理层信息，可以填0忽略"]
    pub user_bmp: u16,
}
#[test]
fn bindgen_test_layout_bb_get_status_in_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_get_status_in_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_get_status_in_t>(),
        2usize,
        concat!("Size of: ", stringify!(bb_get_status_in_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_get_status_in_t>(),
        2usize,
        concat!("Alignment of ", stringify!(bb_get_status_in_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).user_bmp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_status_in_t),
            "::",
            stringify!(user_bmp)
        )
    );
}
#[doc = "定义读取命令BB_GET_PAIR_RESULT的输出参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_get_pair_out_t {
    #[doc = "<@note 配对成功的SLOT位置bitmap"]
    pub slot_bmp: u8,
    #[doc = "<@note 对应SLOT上配对成功的MAC地址"]
    pub peer_mac: [bb_mac_t; 8usize],
    #[doc = "<@note 配对完成时的无线质量统计"]
    pub quality: [bb_quality_t; 8usize],
}
#[test]
fn bindgen_test_layout_bb_get_pair_out_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_get_pair_out_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_get_pair_out_t>(),
        98usize,
        concat!("Size of: ", stringify!(bb_get_pair_out_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_get_pair_out_t>(),
        2usize,
        concat!("Alignment of ", stringify!(bb_get_pair_out_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).slot_bmp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_pair_out_t),
            "::",
            stringify!(slot_bmp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).peer_mac) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_pair_out_t),
            "::",
            stringify!(peer_mac)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).quality) as usize - ptr as usize },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_pair_out_t),
            "::",
            stringify!(quality)
        )
    );
}
#[doc = "定义读取命令BB_GET_AP_MAC的输出参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_get_ap_mac_out_t {
    #[doc = "<@note 接入点MAC"]
    pub mac: bb_mac_t,
}
#[test]
fn bindgen_test_layout_bb_get_ap_mac_out_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_get_ap_mac_out_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_get_ap_mac_out_t>(),
        4usize,
        concat!("Size of: ", stringify!(bb_get_ap_mac_out_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_get_ap_mac_out_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_get_ap_mac_out_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mac) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_ap_mac_out_t),
            "::",
            stringify!(mac)
        )
    );
}
#[doc = "定义读取命令BB_GET_CANDIDATES的输入参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_get_candidates_in_t {
    #[doc = "<@note 指定获取候选人SLOT位置 类型：bb_slot_e"]
    pub slot: u8,
}
#[test]
fn bindgen_test_layout_bb_get_candidates_in_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_get_candidates_in_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_get_candidates_in_t>(),
        1usize,
        concat!("Size of: ", stringify!(bb_get_candidates_in_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_get_candidates_in_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_get_candidates_in_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).slot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_candidates_in_t),
            "::",
            stringify!(slot)
        )
    );
}
#[doc = "定义读取命令BB_GET_CANDIDATES的输出参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_get_candidates_out_t {
    #[doc = "<@note mac_tab中MAC地址的数量"]
    pub mac_num: u8,
    #[doc = "<@note 候选人MAC地址表"]
    pub mac_tab: [bb_mac_t; 5usize],
}
#[test]
fn bindgen_test_layout_bb_get_candidates_out_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_get_candidates_out_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_get_candidates_out_t>(),
        21usize,
        concat!("Size of: ", stringify!(bb_get_candidates_out_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_get_candidates_out_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_get_candidates_out_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mac_num) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_candidates_out_t),
            "::",
            stringify!(mac_num)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mac_tab) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_candidates_out_t),
            "::",
            stringify!(mac_tab)
        )
    );
}
#[doc = "定义读取命令BB_GET_USER_QUALITY的输入参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_get_user_quality_in_t {
    #[doc = "<@note 需要获取信号量的物理用户bitmap"]
    pub user_bmp: u16,
    #[doc = "<@note 当arerage为0，返回SDK内部实时信号质量，当为1时，返回SDK内部一个采样周期的平均值"]
    pub average: u16,
}
#[test]
fn bindgen_test_layout_bb_get_user_quality_in_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_get_user_quality_in_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_get_user_quality_in_t>(),
        4usize,
        concat!("Size of: ", stringify!(bb_get_user_quality_in_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_get_user_quality_in_t>(),
        2usize,
        concat!("Alignment of ", stringify!(bb_get_user_quality_in_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).user_bmp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_user_quality_in_t),
            "::",
            stringify!(user_bmp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).average) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_user_quality_in_t),
            "::",
            stringify!(average)
        )
    );
}
#[doc = "定义读取命令BB_GET_USER_QUALITY的输出参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_get_user_quality_out_t {
    #[doc = "<@note 分用户的信号量，当值为全0，表示该用户信号质量无效"]
    pub qualities: [bb_quality_t; 10usize],
}
#[test]
fn bindgen_test_layout_bb_get_user_quality_out_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_get_user_quality_out_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_get_user_quality_out_t>(),
        80usize,
        concat!("Size of: ", stringify!(bb_get_user_quality_out_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_get_user_quality_out_t>(),
        2usize,
        concat!("Alignment of ", stringify!(bb_get_user_quality_out_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).qualities) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_user_quality_out_t),
            "::",
            stringify!(qualities)
        )
    );
}
#[doc = "定义读取命令BB_GET_DISTC_RESULT的输入参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_get_distc_result_in_t {
    #[doc = "<@note 需要读取  slot位置bitmap"]
    pub slot_bmp: u8,
}
#[test]
fn bindgen_test_layout_bb_get_distc_result_in_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_get_distc_result_in_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_get_distc_result_in_t>(),
        1usize,
        concat!("Size of: ", stringify!(bb_get_distc_result_in_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_get_distc_result_in_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_get_distc_result_in_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).slot_bmp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_distc_result_in_t),
            "::",
            stringify!(slot_bmp)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_get_peer_quality_in_t {
    #[doc = "<@note 需要读取peer slot位置bitmap，dev侧按BB_SLOT_AP来设置"]
    pub slot_bmp: u8,
    #[doc = "<@note 为扩展预留"]
    pub arverage: u8,
}
#[test]
fn bindgen_test_layout_bb_get_peer_quality_in_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_get_peer_quality_in_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_get_peer_quality_in_t>(),
        2usize,
        concat!("Size of: ", stringify!(bb_get_peer_quality_in_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_get_peer_quality_in_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_get_peer_quality_in_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).slot_bmp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_peer_quality_in_t),
            "::",
            stringify!(slot_bmp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).arverage) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_peer_quality_in_t),
            "::",
            stringify!(arverage)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_get_peer_quality_out_t {
    #[doc = "<@note peer slot信号质量"]
    pub qualities: [bb_quality_t; 8usize],
}
#[test]
fn bindgen_test_layout_bb_get_peer_quality_out_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_get_peer_quality_out_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_get_peer_quality_out_t>(),
        64usize,
        concat!("Size of: ", stringify!(bb_get_peer_quality_out_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_get_peer_quality_out_t>(),
        2usize,
        concat!("Alignment of ", stringify!(bb_get_peer_quality_out_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).qualities) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_peer_quality_out_t),
            "::",
            stringify!(qualities)
        )
    );
}
#[doc = "定义读取命令BB_GET_AP_TIME的输出参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_get_ap_time_out_t {
    #[doc = "<@note AP的时间戳，系统起来后运行的毫秒数"]
    pub timestamp: u32,
}
#[test]
fn bindgen_test_layout_bb_get_ap_time_out_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_get_ap_time_out_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_get_ap_time_out_t>(),
        4usize,
        concat!("Size of: ", stringify!(bb_get_ap_time_out_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_get_ap_time_out_t>(),
        4usize,
        concat!("Alignment of ", stringify!(bb_get_ap_time_out_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timestamp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_ap_time_out_t),
            "::",
            stringify!(timestamp)
        )
    );
}
#[doc = "定义读取命令BB_GET_DISTC_RESULT的输出参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_get_distc_result_out_t {
    #[doc = "<@note 测距结果，无测距结果时为-1，>=为测距结果，用户未指定slot位置的值未知"]
    pub distance: [i32; 8usize],
}
#[test]
fn bindgen_test_layout_bb_get_distc_result_out_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_get_distc_result_out_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_get_distc_result_out_t>(),
        32usize,
        concat!("Size of: ", stringify!(bb_get_distc_result_out_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_get_distc_result_out_t>(),
        4usize,
        concat!("Alignment of ", stringify!(bb_get_distc_result_out_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).distance) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_distc_result_out_t),
            "::",
            stringify!(distance)
        )
    );
}
#[doc = "定义读取命令BB_GET_MCS的输入参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_get_mcs_in_t {
    #[doc = "<@note 获取MCS的方向 类型：bb_dir_e"]
    pub dir: u8,
    #[doc = "<@note 获取MCS的slot 类型：bb_slot_e"]
    pub slot: u8,
}
#[test]
fn bindgen_test_layout_bb_get_mcs_in_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_get_mcs_in_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_get_mcs_in_t>(),
        2usize,
        concat!("Size of: ", stringify!(bb_get_mcs_in_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_get_mcs_in_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_get_mcs_in_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dir) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_mcs_in_t),
            "::",
            stringify!(dir)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).slot) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_mcs_in_t),
            "::",
            stringify!(slot)
        )
    );
}
#[doc = "定义读取命令BB_GET_MCS的输出参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_get_mcs_out_t {
    #[doc = "<@note 当前slot的MCS，类型：bb_phy_mcs_e"]
    pub mcs: u8,
    #[doc = "<@note 当前slot的理论吞吐率（数据发送能力）单位：kbps"]
    pub throughput: u32,
}
#[test]
fn bindgen_test_layout_bb_get_mcs_out_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_get_mcs_out_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_get_mcs_out_t>(),
        8usize,
        concat!("Size of: ", stringify!(bb_get_mcs_out_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_get_mcs_out_t>(),
        4usize,
        concat!("Alignment of ", stringify!(bb_get_mcs_out_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mcs) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_mcs_out_t),
            "::",
            stringify!(mcs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).throughput) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_mcs_out_t),
            "::",
            stringify!(throughput)
        )
    );
}
#[doc = "定义设置命令BB_GET_MCS_MODE的输入参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_get_mcs_mode_in_t {
    #[doc = "<@attention MCS模式控制的SLOT位置 类型：bb_slot_e"]
    pub slot: u8,
}
#[test]
fn bindgen_test_layout_bb_get_mcs_mode_in_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_get_mcs_mode_in_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_get_mcs_mode_in_t>(),
        1usize,
        concat!("Size of: ", stringify!(bb_get_mcs_mode_in_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_get_mcs_mode_in_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_get_mcs_mode_in_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).slot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_mcs_mode_in_t),
            "::",
            stringify!(slot)
        )
    );
}
#[doc = "定义设置命令BB_GET_MCS_MODE的输出参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_get_mcs_mode_out_t {
    #[doc = "<@note MCS控制模式 1：MCS自适应，0：MCS手工模式，只有在手工模式才支持设置MCS挡位"]
    pub auto_mode: u8,
}
#[test]
fn bindgen_test_layout_bb_get_mcs_mode_out_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_get_mcs_mode_out_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_get_mcs_mode_out_t>(),
        1usize,
        concat!("Size of: ", stringify!(bb_get_mcs_mode_out_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_get_mcs_mode_out_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_get_mcs_mode_out_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).auto_mode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_mcs_mode_out_t),
            "::",
            stringify!(auto_mode)
        )
    );
}
#[doc = "定义读取命令BB_GET_CHAN_INFO的输出参数结构"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bb_get_chan_info_out_t {
    #[doc = "<@note 信道数量"]
    pub chan_num: u8,
    #[doc = "<@note 信道自适应 1：自适应 0：手动"]
    pub auto_mode: u8,
    pub acs_chan: u8,
    #[doc = "<@attention 工作信道，不同基带模式及不同角色对工作信道定义有区别，一般来说，work_chan指示当前设备收信号的工作信道"]
    pub work_chan: u8,
    pub padding: [u8; 220usize],
    #[doc = "<@note 信道频点 单位：KHz"]
    pub freq: [u32; 100usize],
    #[doc = "<@note 扫频均化能量 单位：dbm"]
    pub power: [i32; 100usize],
}
#[test]
fn bindgen_test_layout_bb_get_chan_info_out_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_get_chan_info_out_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_get_chan_info_out_t>(),
        1024usize,
        concat!("Size of: ", stringify!(bb_get_chan_info_out_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_get_chan_info_out_t>(),
        4usize,
        concat!("Alignment of ", stringify!(bb_get_chan_info_out_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).chan_num) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_chan_info_out_t),
            "::",
            stringify!(chan_num)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).auto_mode) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_chan_info_out_t),
            "::",
            stringify!(auto_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).acs_chan) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_chan_info_out_t),
            "::",
            stringify!(acs_chan)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).work_chan) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_chan_info_out_t),
            "::",
            stringify!(work_chan)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_chan_info_out_t),
            "::",
            stringify!(padding)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).freq) as usize - ptr as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_chan_info_out_t),
            "::",
            stringify!(freq)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).power) as usize - ptr as usize },
        624usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_chan_info_out_t),
            "::",
            stringify!(power)
        )
    );
}
impl Default for bb_get_chan_info_out_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "定义读取命令BB_GET_REG的输入参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_get_reg_in_t {
    #[doc = "<@note 读取基带寄存器偏移量，应<BB_REG_PAGE_NUM*BB_REG_PAGE_SIZE"]
    pub offset: u16,
    #[doc = "<@note 读取基带寄存器的字节长度，应<=BB_REG_PAGE_SIZE并且不超过寄存器空间有效范围"]
    pub length: u16,
}
#[test]
fn bindgen_test_layout_bb_get_reg_in_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_get_reg_in_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_get_reg_in_t>(),
        4usize,
        concat!("Size of: ", stringify!(bb_get_reg_in_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_get_reg_in_t>(),
        2usize,
        concat!("Alignment of ", stringify!(bb_get_reg_in_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offset) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_reg_in_t),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).length) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_reg_in_t),
            "::",
            stringify!(length)
        )
    );
}
#[doc = "定义读取命令BB_GET_REG的输出参数结构"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bb_get_reg_out_t {
    #[doc = "<@note 由输入参数确定读取的寄存器内容"]
    pub data: [u8; 256usize],
}
#[test]
fn bindgen_test_layout_bb_get_reg_out_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_get_reg_out_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_get_reg_out_t>(),
        256usize,
        concat!("Size of: ", stringify!(bb_get_reg_out_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_get_reg_out_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_get_reg_out_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_reg_out_t),
            "::",
            stringify!(data)
        )
    );
}
impl Default for bb_get_reg_out_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "定义读取命令BB_GET_CFG的输入参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_get_cfg_in_t {
    #[doc = "<@note 命令序列号，单调递增"]
    pub seq: u16,
    #[doc = "<@note 加载模式, 0:auto, 1:memory, 2:flash"]
    pub mode: u8,
    #[doc = "<@note 保留字段"]
    pub rsv: u8,
    #[doc = "<@note 读取基带配置文件偏移量"]
    pub offset: u16,
    #[doc = "<@note 读取基带配置文件的字节长度，应<=ioctrl缓冲区最大长度"]
    pub length: u16,
}
#[test]
fn bindgen_test_layout_bb_get_cfg_in_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_get_cfg_in_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_get_cfg_in_t>(),
        8usize,
        concat!("Size of: ", stringify!(bb_get_cfg_in_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_get_cfg_in_t>(),
        2usize,
        concat!("Alignment of ", stringify!(bb_get_cfg_in_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).seq) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_cfg_in_t),
            "::",
            stringify!(seq)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mode) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_cfg_in_t),
            "::",
            stringify!(mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rsv) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_cfg_in_t),
            "::",
            stringify!(rsv)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offset) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_cfg_in_t),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).length) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_cfg_in_t),
            "::",
            stringify!(length)
        )
    );
}
#[doc = "定义读取命令BB_GET_CFG的输出参数结构"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bb_get_cfg_out_t {
    #[doc = "<@note 命令序列号，等于请求的序列号"]
    pub seq: u16,
    #[doc = "<@note 保留字段"]
    pub rsv: u16,
    #[doc = "<@note 基带配置文件总长度"]
    pub total_length: u16,
    #[doc = "<@note 基带配置文件crc16校验码"]
    pub total_crc16: u16,
    #[doc = "<@note 设置基带配置文件偏移量"]
    pub offset: u16,
    #[doc = "<@note 设置基带配置文件的字节长度"]
    pub length: u16,
    #[doc = "<@note 由输入参数确定读取的配置文件内容"]
    pub data: [u8; 1012usize],
}
#[test]
fn bindgen_test_layout_bb_get_cfg_out_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_get_cfg_out_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_get_cfg_out_t>(),
        1024usize,
        concat!("Size of: ", stringify!(bb_get_cfg_out_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_get_cfg_out_t>(),
        2usize,
        concat!("Alignment of ", stringify!(bb_get_cfg_out_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).seq) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_cfg_out_t),
            "::",
            stringify!(seq)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rsv) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_cfg_out_t),
            "::",
            stringify!(rsv)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).total_length) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_cfg_out_t),
            "::",
            stringify!(total_length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).total_crc16) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_cfg_out_t),
            "::",
            stringify!(total_crc16)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offset) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_cfg_out_t),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).length) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_cfg_out_t),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_cfg_out_t),
            "::",
            stringify!(data)
        )
    );
}
impl Default for bb_get_cfg_out_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "定义读取命令BB_GET_DBG_MODE的输出参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_get_dbg_mode_out_t {
    #[doc = "<@note debug模式使能与否 1：使能 0：关闭"]
    pub enable: u8,
}
#[test]
fn bindgen_test_layout_bb_get_dbg_mode_out_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_get_dbg_mode_out_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_get_dbg_mode_out_t>(),
        1usize,
        concat!("Size of: ", stringify!(bb_get_dbg_mode_out_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_get_dbg_mode_out_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_get_dbg_mode_out_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enable) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_dbg_mode_out_t),
            "::",
            stringify!(enable)
        )
    );
}
#[doc = "定义读取命令BB_GET_POWER_MODE的输出参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_get_pwr_mode_out_t {
    #[doc = "<@note 获取发射功率开闭环模式，取值参见:bb_phy_pwr_mode_e"]
    pub pwr_mode: u8,
}
#[test]
fn bindgen_test_layout_bb_get_pwr_mode_out_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_get_pwr_mode_out_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_get_pwr_mode_out_t>(),
        1usize,
        concat!("Size of: ", stringify!(bb_get_pwr_mode_out_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_get_pwr_mode_out_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_get_pwr_mode_out_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pwr_mode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_pwr_mode_out_t),
            "::",
            stringify!(pwr_mode)
        )
    );
}
#[doc = "定义读取命令BB_GET_CUR_POWER的输入参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_get_cur_pwr_in_t {
    #[doc = "<@note 获取指定用户的当前功率，取值参见：bb_user_e"]
    pub usr: u8,
}
#[test]
fn bindgen_test_layout_bb_get_cur_pwr_in_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_get_cur_pwr_in_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_get_cur_pwr_in_t>(),
        1usize,
        concat!("Size of: ", stringify!(bb_get_cur_pwr_in_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_get_cur_pwr_in_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_get_cur_pwr_in_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).usr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_cur_pwr_in_t),
            "::",
            stringify!(usr)
        )
    );
}
#[doc = "定义读取命令BB_GET_CUR_POWER的输入参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_get_cur_pwr_out_t {
    #[doc = "<@note 当前发射功率对应的用户"]
    pub usr: u8,
    #[doc = "<@note 当前发射功率"]
    pub pwr: u8,
}
#[test]
fn bindgen_test_layout_bb_get_cur_pwr_out_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_get_cur_pwr_out_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_get_cur_pwr_out_t>(),
        2usize,
        concat!("Size of: ", stringify!(bb_get_cur_pwr_out_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_get_cur_pwr_out_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_get_cur_pwr_out_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).usr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_cur_pwr_out_t),
            "::",
            stringify!(usr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pwr) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_cur_pwr_out_t),
            "::",
            stringify!(pwr)
        )
    );
}
#[doc = "定义读取命令BB_GET_PWR_AUTO的输入参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_get_pwr_auto_out_t {
    #[doc = "<@note 功率自适应是否使能"]
    pub pwr_auto: u8,
}
#[test]
fn bindgen_test_layout_bb_get_pwr_auto_out_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_get_pwr_auto_out_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_get_pwr_auto_out_t>(),
        1usize,
        concat!("Size of: ", stringify!(bb_get_pwr_auto_out_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_get_pwr_auto_out_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_get_pwr_auto_out_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pwr_auto) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_pwr_auto_out_t),
            "::",
            stringify!(pwr_auto)
        )
    );
}
#[doc = "定义读取命令BB_GET_SYS_INFO的输出参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_get_sys_info_out_t {
    #[doc = "<@note 获取系统运行时间"]
    pub uptime: u64,
    #[doc = "<@note 编译时间"]
    pub compile_time: [::std::os::raw::c_char; 32usize],
    #[doc = "<@note 软件版本"]
    pub soft_ver: [::std::os::raw::c_char; 32usize],
    #[doc = "<@note 硬件版本"]
    pub hardware_ver: [::std::os::raw::c_char; 32usize],
    #[doc = "<@note 固件版本"]
    pub firmware_ver: [::std::os::raw::c_char; 32usize],
}
#[test]
fn bindgen_test_layout_bb_get_sys_info_out_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_get_sys_info_out_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_get_sys_info_out_t>(),
        136usize,
        concat!("Size of: ", stringify!(bb_get_sys_info_out_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_get_sys_info_out_t>(),
        8usize,
        concat!("Alignment of ", stringify!(bb_get_sys_info_out_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uptime) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_sys_info_out_t),
            "::",
            stringify!(uptime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).compile_time) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_sys_info_out_t),
            "::",
            stringify!(compile_time)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).soft_ver) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_sys_info_out_t),
            "::",
            stringify!(soft_ver)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hardware_ver) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_sys_info_out_t),
            "::",
            stringify!(hardware_ver)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).firmware_ver) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_sys_info_out_t),
            "::",
            stringify!(firmware_ver)
        )
    );
}
#[doc = "定义读取命令BB_GET_PRJ_DISPATCH的输入参数结构"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bb_get_prj_dispatch_in_t {
    pub data: [u8; 256usize],
}
#[test]
fn bindgen_test_layout_bb_get_prj_dispatch_in_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_get_prj_dispatch_in_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_get_prj_dispatch_in_t>(),
        256usize,
        concat!("Size of: ", stringify!(bb_get_prj_dispatch_in_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_get_prj_dispatch_in_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_get_prj_dispatch_in_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_prj_dispatch_in_t),
            "::",
            stringify!(data)
        )
    );
}
impl Default for bb_get_prj_dispatch_in_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "定义读取命令BB_GET_PRJ_DISPATCH的输出参数结构"]
pub type bb_get_prj_dispatch_out_t = bb_get_prj_dispatch_in_t;
#[doc = "定义异步调用回调函数指针"]
pub type ioctl_asyn_cb = ::std::option::Option<
    unsafe extern "C" fn(priv_: *mut ::std::os::raw::c_void, ret: u32) -> ::std::os::raw::c_int,
>;
#[doc = "定义命令BB_REMOTE_IOCTL_REQ的输入参数结构"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct bb_remote_ioctl_in_t {
    pub slot: u8,
    pub len: u16,
    pub msg_id: u32,
    pub data: [u8; 1024usize],
}
#[test]
fn bindgen_test_layout_bb_remote_ioctl_in_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_remote_ioctl_in_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_remote_ioctl_in_t>(),
        1031usize,
        concat!("Size of: ", stringify!(bb_remote_ioctl_in_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_remote_ioctl_in_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_remote_ioctl_in_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).slot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_remote_ioctl_in_t),
            "::",
            stringify!(slot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).len) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_remote_ioctl_in_t),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_id) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_remote_ioctl_in_t),
            "::",
            stringify!(msg_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_remote_ioctl_in_t),
            "::",
            stringify!(data)
        )
    );
}
impl Default for bb_remote_ioctl_in_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "定义读取命令BB_REMOTE_IOCTL_REQ的输出参数结构"]
pub type bb_remote_ioctl_out_t = bb_remote_ioctl_in_t;
#[doc = "定义命令BB_REMOTE_IOCTL_REQ_EX的输入参数结构"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct bb_remote_ioctl_ex_in_t {
    pub side: u8,
    pub role: u8,
    pub slot: u8,
    pub len: u16,
    pub msg_id: u32,
    pub data: [u8; 1024usize],
}
#[test]
fn bindgen_test_layout_bb_remote_ioctl_ex_in_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_remote_ioctl_ex_in_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_remote_ioctl_ex_in_t>(),
        1033usize,
        concat!("Size of: ", stringify!(bb_remote_ioctl_ex_in_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_remote_ioctl_ex_in_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_remote_ioctl_ex_in_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).side) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_remote_ioctl_ex_in_t),
            "::",
            stringify!(side)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).role) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_remote_ioctl_ex_in_t),
            "::",
            stringify!(role)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).slot) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_remote_ioctl_ex_in_t),
            "::",
            stringify!(slot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).len) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_remote_ioctl_ex_in_t),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_id) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_remote_ioctl_ex_in_t),
            "::",
            stringify!(msg_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_remote_ioctl_ex_in_t),
            "::",
            stringify!(data)
        )
    );
}
impl Default for bb_remote_ioctl_ex_in_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "定义读取命令BB_REMOTE_IOCTL_REQ_EX的输出参数结构"]
pub type bb_remote_ioctl_ex_out_t = bb_remote_ioctl_ex_in_t;
#[doc = "定义读取命令BB_GET_BAND_INFO的输入输出参数"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_get_band_info_in_t {
    pub rsv: [::std::os::raw::c_char; 32usize],
}
#[test]
fn bindgen_test_layout_bb_get_band_info_in_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_get_band_info_in_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_get_band_info_in_t>(),
        32usize,
        concat!("Size of: ", stringify!(bb_get_band_info_in_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_get_band_info_in_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_get_band_info_in_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rsv) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_band_info_in_t),
            "::",
            stringify!(rsv)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_get_band_info_out_t {
    #[doc = "<@note 1=频段自适应，0=频段手动控制"]
    pub band_mode: u8,
    #[doc = "<@note 当前工作频段，类型：bb_band_e"]
    pub work_band: u8,
    pub rsv: [::std::os::raw::c_char; 30usize],
}
#[test]
fn bindgen_test_layout_bb_get_band_info_out_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_get_band_info_out_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_get_band_info_out_t>(),
        32usize,
        concat!("Size of: ", stringify!(bb_get_band_info_out_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_get_band_info_out_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_get_band_info_out_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).band_mode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_band_info_out_t),
            "::",
            stringify!(band_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).work_band) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_band_info_out_t),
            "::",
            stringify!(work_band)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rsv) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_band_info_out_t),
            "::",
            stringify!(rsv)
        )
    );
}
#[doc = "定义读取命令BB_GET_USER_INFO的输入参数"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_get_user_info_in_t {
    #[doc = "<@note 用户ID 类型：bb_user_e"]
    pub user: u8,
}
#[test]
fn bindgen_test_layout_bb_get_user_info_in_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_get_user_info_in_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_get_user_info_in_t>(),
        1usize,
        concat!("Size of: ", stringify!(bb_get_user_info_in_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_get_user_info_in_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_get_user_info_in_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).user) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_user_info_in_t),
            "::",
            stringify!(user)
        )
    );
}
#[doc = "定义读取命令BB_GET_BAND_INFO的输出参数"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bb_get_user_info_out_t {
    #[doc = "<@note 用户频偏值"]
    pub freq_offset: i32,
    pub rsv: [u8; 124usize],
}
#[test]
fn bindgen_test_layout_bb_get_user_info_out_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_get_user_info_out_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_get_user_info_out_t>(),
        128usize,
        concat!("Size of: ", stringify!(bb_get_user_info_out_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_get_user_info_out_t>(),
        4usize,
        concat!("Alignment of ", stringify!(bb_get_user_info_out_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).freq_offset) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_user_info_out_t),
            "::",
            stringify!(freq_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rsv) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_user_info_out_t),
            "::",
            stringify!(rsv)
        )
    );
}
impl Default for bb_get_user_info_out_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "定义读取命令BB_GET_1V1_INFO的输出参数"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_get_1v1_info_in_t {
    #[doc = "<@note 统计多少帧，0代表默认(64帧)，最大64帧"]
    pub frame_num: u8,
    pub rsv: [u8; 3usize],
}
#[test]
fn bindgen_test_layout_bb_get_1v1_info_in_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_get_1v1_info_in_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_get_1v1_info_in_t>(),
        4usize,
        concat!("Size of: ", stringify!(bb_get_1v1_info_in_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_get_1v1_info_in_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_get_1v1_info_in_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frame_num) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_1v1_info_in_t),
            "::",
            stringify!(frame_num)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rsv) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_1v1_info_in_t),
            "::",
            stringify!(rsv)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_lfs_quality_t {
    pub chan_snr: u16,
    pub gain_a: u8,
    pub gain_b: u8,
}
#[test]
fn bindgen_test_layout_bb_lfs_quality_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_lfs_quality_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_lfs_quality_t>(),
        4usize,
        concat!("Size of: ", stringify!(bb_lfs_quality_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_lfs_quality_t>(),
        2usize,
        concat!("Alignment of ", stringify!(bb_lfs_quality_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).chan_snr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_lfs_quality_t),
            "::",
            stringify!(chan_snr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gain_a) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_lfs_quality_t),
            "::",
            stringify!(gain_a)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gain_b) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_lfs_quality_t),
            "::",
            stringify!(gain_b)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bb_info_t {
    #[doc = "<@note 物理用户接收信噪比，转化db公式：10log(snr/36)"]
    pub snr: u16,
    #[doc = "<@note 交织块中解码错误的LDPC块个数所占的比例，不想出现小数，扩大了10000倍"]
    pub ldpc_tlv_err_ratio: u16,
    #[doc = "<@note 解码错误的帧个数比例，不想出现小数，扩大了10000倍"]
    pub ldpc_num_err_ratio: u16,
    #[doc = "<@note A路天线接收信号强度"]
    pub gain_a: u8,
    #[doc = "<@note B路天线接收信号强度"]
    pub gain_b: u8,
    #[doc = "<@note TX MCS"]
    pub tx_mcs: u8,
    #[doc = "<@note TX channel"]
    pub tx_chan: u8,
    #[doc = "<@note TX power"]
    pub tx_power: u8,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    #[doc = "<@note TX freq khz"]
    pub tx_freq_khz: u32,
    #[doc = "<@note 2G长扫频质量"]
    pub lfs_low_band: bb_lfs_quality_t,
    #[doc = "<@note 5G长扫频质量"]
    pub lfs_high_band: bb_lfs_quality_t,
    pub rev: [u8; 48usize],
}
#[test]
fn bindgen_test_layout_bb_info_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_info_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_info_t>(),
        72usize,
        concat!("Size of: ", stringify!(bb_info_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_info_t>(),
        4usize,
        concat!("Alignment of ", stringify!(bb_info_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).snr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_info_t),
            "::",
            stringify!(snr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ldpc_tlv_err_ratio) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_info_t),
            "::",
            stringify!(ldpc_tlv_err_ratio)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ldpc_num_err_ratio) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_info_t),
            "::",
            stringify!(ldpc_num_err_ratio)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gain_a) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_info_t),
            "::",
            stringify!(gain_a)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gain_b) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_info_t),
            "::",
            stringify!(gain_b)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tx_mcs) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_info_t),
            "::",
            stringify!(tx_mcs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tx_chan) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_info_t),
            "::",
            stringify!(tx_chan)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tx_power) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_info_t),
            "::",
            stringify!(tx_power)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tx_freq_khz) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_info_t),
            "::",
            stringify!(tx_freq_khz)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lfs_low_band) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_info_t),
            "::",
            stringify!(lfs_low_band)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lfs_high_band) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_info_t),
            "::",
            stringify!(lfs_high_band)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rev) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_info_t),
            "::",
            stringify!(rev)
        )
    );
}
impl Default for bb_info_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl bb_info_t {
    #[inline]
    pub fn lna_inner_bypass(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_lna_inner_bypass(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn lna_fem_bypass(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_lna_fem_bypass(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rf_1tx(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rf_1tx(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        lna_inner_bypass: u8,
        lna_fem_bypass: u8,
        rf_1tx: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let lna_inner_bypass: u8 = unsafe { ::std::mem::transmute(lna_inner_bypass) };
            lna_inner_bypass as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let lna_fem_bypass: u8 = unsafe { ::std::mem::transmute(lna_fem_bypass) };
            lna_fem_bypass as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let rf_1tx: u8 = unsafe { ::std::mem::transmute(rf_1tx) };
            rf_1tx as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "定义读取命令BB_GET_1V1_INFO的输出参数"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bb_get_1v1_info_out_t {
    #[doc = "<@note 本设备属性"]
    pub self_: bb_info_t,
    #[doc = "<@note 对端设备属性"]
    pub peer: bb_info_t,
    pub rev: [u8; 64usize],
}
#[test]
fn bindgen_test_layout_bb_get_1v1_info_out_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_get_1v1_info_out_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_get_1v1_info_out_t>(),
        208usize,
        concat!("Size of: ", stringify!(bb_get_1v1_info_out_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_get_1v1_info_out_t>(),
        4usize,
        concat!("Alignment of ", stringify!(bb_get_1v1_info_out_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).self_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_1v1_info_out_t),
            "::",
            stringify!(self_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).peer) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_1v1_info_out_t),
            "::",
            stringify!(peer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rev) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_1v1_info_out_t),
            "::",
            stringify!(rev)
        )
    );
}
impl Default for bb_get_1v1_info_out_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "定义读取命令BB_GET_SOCK_INFO的输入参数"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_get_sock_info_in_t {
    #[doc = "<@note 指定要获取的slot 类型：bb_slot_e"]
    pub slot: u8,
    #[doc = "<@note 指定要获的port id，当port < 0则获取系统所有socket的信息"]
    pub port: i8,
    pub padding: [u8; 2usize],
}
#[test]
fn bindgen_test_layout_bb_get_sock_info_in_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_get_sock_info_in_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_get_sock_info_in_t>(),
        4usize,
        concat!("Size of: ", stringify!(bb_get_sock_info_in_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_get_sock_info_in_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_get_sock_info_in_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).slot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_sock_info_in_t),
            "::",
            stringify!(slot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).port) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_sock_info_in_t),
            "::",
            stringify!(port)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_sock_info_in_t),
            "::",
            stringify!(padding)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_sock_uni_t {
    #[doc = "<@note 数据有效"]
    pub available: u8,
    pub padding: u8,
    #[doc = "<@note buf溢出的计数"]
    pub overflow_cnt: u16,
    #[doc = "<@note buf的size"]
    pub buf_size: u32,
    #[doc = "<@note 当前buf内数据量"]
    pub data_size: u32,
    #[doc = "<@note 从buf通过的总数据量"]
    pub total_size: u64,
    pub reserved: [u8; 12usize],
}
#[test]
fn bindgen_test_layout_bb_sock_uni_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_sock_uni_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_sock_uni_t>(),
        40usize,
        concat!("Size of: ", stringify!(bb_sock_uni_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_sock_uni_t>(),
        8usize,
        concat!("Alignment of ", stringify!(bb_sock_uni_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).available) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_sock_uni_t),
            "::",
            stringify!(available)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_sock_uni_t),
            "::",
            stringify!(padding)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).overflow_cnt) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_sock_uni_t),
            "::",
            stringify!(overflow_cnt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).buf_size) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_sock_uni_t),
            "::",
            stringify!(buf_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data_size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_sock_uni_t),
            "::",
            stringify!(data_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).total_size) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_sock_uni_t),
            "::",
            stringify!(total_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_sock_uni_t),
            "::",
            stringify!(reserved)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_sock_info_t {
    #[doc = "<@note 双向数据信息"]
    pub uni_info: [bb_sock_uni_t; 2usize],
}
#[test]
fn bindgen_test_layout_bb_sock_info_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_sock_info_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_sock_info_t>(),
        80usize,
        concat!("Size of: ", stringify!(bb_sock_info_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_sock_info_t>(),
        8usize,
        concat!("Alignment of ", stringify!(bb_sock_info_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uni_info) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_sock_info_t),
            "::",
            stringify!(uni_info)
        )
    );
}
#[doc = "定义读取命令BB_GET_SOCK_INFO的输出参数"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_get_sock_info_out_t {
    pub port_bmp: u8,
    pub padding: [u8; 3usize],
    pub sock_info: [bb_sock_info_t; 8usize],
}
#[test]
fn bindgen_test_layout_bb_get_sock_info_out_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_get_sock_info_out_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_get_sock_info_out_t>(),
        648usize,
        concat!("Size of: ", stringify!(bb_get_sock_info_out_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_get_sock_info_out_t>(),
        8usize,
        concat!("Alignment of ", stringify!(bb_get_sock_info_out_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).port_bmp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_sock_info_out_t),
            "::",
            stringify!(port_bmp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_sock_info_out_t),
            "::",
            stringify!(padding)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sock_info) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_sock_info_out_t),
            "::",
            stringify!(sock_info)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_get_throughput_in_t {
    #[doc = "<@note 指定要获取的slot 类型：bb_slot_e"]
    pub slot: u8,
    #[doc = "<@note bb_dir_e的bitmap，用于指定获取吞吐率的方向组合"]
    pub dir_bmp: u8,
    pub padding: [u8; 2usize],
}
#[test]
fn bindgen_test_layout_bb_get_throughput_in_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_get_throughput_in_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_get_throughput_in_t>(),
        4usize,
        concat!("Size of: ", stringify!(bb_get_throughput_in_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_get_throughput_in_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_get_throughput_in_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).slot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_throughput_in_t),
            "::",
            stringify!(slot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dir_bmp) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_throughput_in_t),
            "::",
            stringify!(dir_bmp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_throughput_in_t),
            "::",
            stringify!(padding)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_throughtput_t {
    #[doc = "<@note 基带提供的实时物理吞吐率"]
    pub phy_throughput: u32,
    #[doc = "<@note 实际承载的数据吞吐率（含SDK协议头）"]
    pub real_throughput: u32,
}
#[test]
fn bindgen_test_layout_bb_throughtput_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_throughtput_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_throughtput_t>(),
        8usize,
        concat!("Size of: ", stringify!(bb_throughtput_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_throughtput_t>(),
        4usize,
        concat!("Alignment of ", stringify!(bb_throughtput_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).phy_throughput) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_throughtput_t),
            "::",
            stringify!(phy_throughput)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).real_throughput) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_throughtput_t),
            "::",
            stringify!(real_throughput)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_get_throughput_out_t {
    #[doc = "<@note 实时吞吐率"]
    pub throughput: [bb_throughtput_t; 2usize],
}
#[test]
fn bindgen_test_layout_bb_get_throughput_out_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_get_throughput_out_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_get_throughput_out_t>(),
        16usize,
        concat!("Size of: ", stringify!(bb_get_throughput_out_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_get_throughput_out_t>(),
        4usize,
        concat!("Alignment of ", stringify!(bb_get_throughput_out_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).throughput) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_throughput_out_t),
            "::",
            stringify!(throughput)
        )
    );
}
pub const bb_remote_type_e_BB_REMOTE_TYPE_BAND_MODE: bb_remote_type_e = 0;
pub const bb_remote_type_e_BB_REMOTE_TYPE_TARGET_BAND: bb_remote_type_e = 1;
pub const bb_remote_type_e_BB_REMOTE_TYPE_CHAN_MODE: bb_remote_type_e = 2;
pub const bb_remote_type_e_BB_REMOTE_TYPE_TARGET_CHAN: bb_remote_type_e = 3;
pub const bb_remote_type_e_BB_REMOTE_TYPE_COMPLIANCE_MODE: bb_remote_type_e = 4;
pub const bb_remote_type_e_BB_REMOTE_TYPE_PWR_AUTO2: bb_remote_type_e = 5;
pub const bb_remote_type_e_BB_REMOTE_TYPE_TARGET_PWR: bb_remote_type_e = 6;
pub const bb_remote_type_e_BB_REMOTE_TYPE_MAX: bb_remote_type_e = 7;
pub type bb_remote_type_e = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bb_remote_setting_t {
    #[doc = "<@note 1=频段自适应，0=频段手动控制"]
    pub auto_band: u8,
    #[doc = "<@note 设置的目标band"]
    pub target_band: u8,
    #[doc = "<@note 1=信道自适应，0=信道手动控制"]
    pub chan_mode: u8,
    #[doc = "<@note 设置的目标信道"]
    pub target_chan: u8,
    #[doc = "<@note 1=合规模式，0=自由模式"]
    pub compliance_mode: u8,
    #[doc = "<@note 1=功率自适应，0=功率手动模式"]
    pub pwr_auto2: u8,
    #[doc = "<@note 设置目标功率"]
    pub target_pwr: u8,
    pub padding: [u8; 121usize],
}
#[test]
fn bindgen_test_layout_bb_remote_setting_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_remote_setting_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_remote_setting_t>(),
        128usize,
        concat!("Size of: ", stringify!(bb_remote_setting_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_remote_setting_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_remote_setting_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).auto_band) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_remote_setting_t),
            "::",
            stringify!(auto_band)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target_band) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_remote_setting_t),
            "::",
            stringify!(target_band)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).chan_mode) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_remote_setting_t),
            "::",
            stringify!(chan_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target_chan) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_remote_setting_t),
            "::",
            stringify!(target_chan)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).compliance_mode) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_remote_setting_t),
            "::",
            stringify!(compliance_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pwr_auto2) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_remote_setting_t),
            "::",
            stringify!(pwr_auto2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target_pwr) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_remote_setting_t),
            "::",
            stringify!(target_pwr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_remote_setting_t),
            "::",
            stringify!(padding)
        )
    );
}
impl Default for bb_remote_setting_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_get_remote_in_t {
    #[doc = "<@note 获取指定slot位置的remote设置"]
    pub slot: u8,
    pub padding: [u8; 3usize],
    #[doc = "<@note 指定获取的类型bitmap"]
    pub type_bmp: u32,
}
#[test]
fn bindgen_test_layout_bb_get_remote_in_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_get_remote_in_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_get_remote_in_t>(),
        8usize,
        concat!("Size of: ", stringify!(bb_get_remote_in_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_get_remote_in_t>(),
        4usize,
        concat!("Alignment of ", stringify!(bb_get_remote_in_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).slot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_remote_in_t),
            "::",
            stringify!(slot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_remote_in_t),
            "::",
            stringify!(padding)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_bmp) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_remote_in_t),
            "::",
            stringify!(type_bmp)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bb_get_remote_out_t {
    #[doc = "<@note 对应bit置位，说明获取的类型有设置值，否则远端以它的本地配置运行"]
    pub valid_bmp: u32,
    #[doc = "<@note 设置结构体"]
    pub setting: bb_remote_setting_t,
}
#[test]
fn bindgen_test_layout_bb_get_remote_out_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_get_remote_out_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_get_remote_out_t>(),
        132usize,
        concat!("Size of: ", stringify!(bb_get_remote_out_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_get_remote_out_t>(),
        4usize,
        concat!("Alignment of ", stringify!(bb_get_remote_out_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).valid_bmp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_remote_out_t),
            "::",
            stringify!(valid_bmp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).setting) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_remote_out_t),
            "::",
            stringify!(setting)
        )
    );
}
impl Default for bb_get_remote_out_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_get_rf_out_t {
    #[doc = "<@note A路RF TX状态 0=关闭 1=开启"]
    pub path_a_tx_state: u8,
    #[doc = "<@note A路RF RX状态 0=关闭 1=开启"]
    pub path_a_rx_state: u8,
    #[doc = "<@note B路RF TX状态 0=关闭 1=开启"]
    pub path_b_tx_state: u8,
    #[doc = "<@note B路RF RX状态 0=关闭 1=开启"]
    pub path_b_rx_state: u8,
}
#[test]
fn bindgen_test_layout_bb_get_rf_out_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_get_rf_out_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_get_rf_out_t>(),
        4usize,
        concat!("Size of: ", stringify!(bb_get_rf_out_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_get_rf_out_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_get_rf_out_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).path_a_tx_state) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_rf_out_t),
            "::",
            stringify!(path_a_tx_state)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).path_a_rx_state) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_rf_out_t),
            "::",
            stringify!(path_a_rx_state)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).path_b_tx_state) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_rf_out_t),
            "::",
            stringify!(path_b_tx_state)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).path_b_rx_state) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_rf_out_t),
            "::",
            stringify!(path_b_rx_state)
        )
    );
}
pub const bb_runsys_t_BB_RUNSYS_UNKNOWNN: bb_runsys_t = -1;
pub const bb_runsys_t_BB_RUNSYS_MASTER: bb_runsys_t = 0;
pub const bb_runsys_t_BB_RUNSYS_BACKUP: bb_runsys_t = 1;
pub type bb_runsys_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bb_get_runsys_out_t {
    pub runsys_id: bb_runsys_t,
}
#[test]
fn bindgen_test_layout_bb_get_runsys_out_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_get_runsys_out_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_get_runsys_out_t>(),
        4usize,
        concat!("Size of: ", stringify!(bb_get_runsys_out_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_get_runsys_out_t>(),
        4usize,
        concat!("Alignment of ", stringify!(bb_get_runsys_out_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).runsys_id) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_runsys_out_t),
            "::",
            stringify!(runsys_id)
        )
    );
}
impl Default for bb_get_runsys_out_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "定义设置命令BB_SET_EVENT_SUBSCRIBE和BB_SET_EVENT_UNSUBSCRIBE的输入参数结构"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bb_set_event_callback_t {
    #[doc = "<@note 事件类型"]
    pub event: bb_event_e,
    #[doc = "<@note 事件对应的回调函数"]
    pub callback: bb_event_callback,
    #[doc = "<@note 事件回调用户自定义参数，对BB_SET_EVENT_UNSUBSCRIBE命令字无效"]
    pub user: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_bb_set_event_callback_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_set_event_callback_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_set_event_callback_t>(),
        24usize,
        concat!("Size of: ", stringify!(bb_set_event_callback_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_set_event_callback_t>(),
        8usize,
        concat!("Alignment of ", stringify!(bb_set_event_callback_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).event) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_event_callback_t),
            "::",
            stringify!(event)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).callback) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_event_callback_t),
            "::",
            stringify!(callback)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).user) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_event_callback_t),
            "::",
            stringify!(user)
        )
    );
}
impl Default for bb_set_event_callback_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "定义设置命令BB_SET_PAIR_MODE的输入参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_set_pair_mode_t {
    #[doc = "<@note 配对动作，1: 进入配对模式, 0: 退出配对模式"]
    pub start: u8,
    #[doc = "<@note AP侧允许进行配对的SLOT位置bitmap，DEV忽略本字段"]
    pub slot_bmp: u8,
    #[doc = "<@note 进入配对时，设置禁止配对  的黑名单MAC, 如不设黑名单请清0"]
    pub black_list: [bb_mac_t; 3usize],
}
#[test]
fn bindgen_test_layout_bb_set_pair_mode_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_set_pair_mode_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_set_pair_mode_t>(),
        14usize,
        concat!("Size of: ", stringify!(bb_set_pair_mode_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_set_pair_mode_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_set_pair_mode_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).start) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_pair_mode_t),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).slot_bmp) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_pair_mode_t),
            "::",
            stringify!(slot_bmp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).black_list) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_pair_mode_t),
            "::",
            stringify!(black_list)
        )
    );
}
#[doc = "定义设置命令BB_SET_AP_MAC的输入参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_set_ap_mac_t {
    #[doc = "<@note 接入点MAC地址"]
    pub mac: bb_mac_t,
}
#[test]
fn bindgen_test_layout_bb_set_ap_mac_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_set_ap_mac_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_set_ap_mac_t>(),
        4usize,
        concat!("Size of: ", stringify!(bb_set_ap_mac_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_set_ap_mac_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_set_ap_mac_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mac) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_ap_mac_t),
            "::",
            stringify!(mac)
        )
    );
}
#[doc = "定义设置命令BB_SET_LOCAL_MAC的输入参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_set_local_mac_t {
    pub mac: bb_mac_t,
}
#[test]
fn bindgen_test_layout_bb_set_local_mac_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_set_local_mac_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_set_local_mac_t>(),
        4usize,
        concat!("Size of: ", stringify!(bb_set_local_mac_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_set_local_mac_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_set_local_mac_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mac) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_local_mac_t),
            "::",
            stringify!(mac)
        )
    );
}
#[doc = "定义设置命令BB_SET_CHAN_MODE的输入参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_set_chan_mode_t {
    #[doc = "<@note 信道工作模式 1：信道自适应，0：手工模式，只有在手工模式才支持设置信道"]
    pub auto_mode: u8,
}
#[test]
fn bindgen_test_layout_bb_set_chan_mode_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_set_chan_mode_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_set_chan_mode_t>(),
        1usize,
        concat!("Size of: ", stringify!(bb_set_chan_mode_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_set_chan_mode_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_set_chan_mode_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).auto_mode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_chan_mode_t),
            "::",
            stringify!(auto_mode)
        )
    );
}
#[doc = "定义设置命令BB_SET_CHAN的输入参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_set_chan_t {
    #[doc = "<@note 跳频的信道方向，目前只有导演模式支持TX方向（广播信道）的频道控制 类型：bb_dir_e"]
    pub chan_dir: u8,
    #[doc = "<@note 信道索引值，必须是合法额预制信道索引"]
    pub chan_index: u8,
}
#[test]
fn bindgen_test_layout_bb_set_chan_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_set_chan_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_set_chan_t>(),
        2usize,
        concat!("Size of: ", stringify!(bb_set_chan_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_set_chan_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_set_chan_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).chan_dir) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_chan_t),
            "::",
            stringify!(chan_dir)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).chan_index) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_chan_t),
            "::",
            stringify!(chan_index)
        )
    );
}
#[doc = "定义设置命令BB_SET_MCS_MODE的输入参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_set_mcs_mode_t {
    #[doc = "<@attention MCS模式控制的SLOT位置 类型：bb_slot_e"]
    pub slot: u8,
    #[doc = "<@note MCS控制模式 1：MCS自适应，0：MCS手工模式，只有在手工模式才支持设置MCS挡位"]
    pub auto_mode: u8,
}
#[test]
fn bindgen_test_layout_bb_set_mcs_mode_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_set_mcs_mode_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_set_mcs_mode_t>(),
        2usize,
        concat!("Size of: ", stringify!(bb_set_mcs_mode_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_set_mcs_mode_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_set_mcs_mode_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).slot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_mcs_mode_t),
            "::",
            stringify!(slot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).auto_mode) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_mcs_mode_t),
            "::",
            stringify!(auto_mode)
        )
    );
}
#[doc = "定义设置命令BB_SET_MCS的输入参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_set_mcs_t {
    #[doc = "<@attention MCS设置的SLOT位置 类型：bb_slot_e"]
    pub slot: u8,
    #[doc = "<@attention 目标MCS挡位,目前挡位必须是MCS表中有定义的值 类型：bb_phy_mcs_e"]
    pub mcs: u8,
}
#[test]
fn bindgen_test_layout_bb_set_mcs_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_set_mcs_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_set_mcs_t>(),
        2usize,
        concat!("Size of: ", stringify!(bb_set_mcs_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_set_mcs_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_set_mcs_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).slot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_mcs_t),
            "::",
            stringify!(slot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mcs) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_mcs_t),
            "::",
            stringify!(mcs)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_set_master_dev_t {
    #[doc = "<@attention 设置主dev的slot位置，当slot>最大导演模式dev数量，则表示取消主dev模式 类型：bb_slot_e"]
    pub slot: u8,
}
#[test]
fn bindgen_test_layout_bb_set_master_dev_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_set_master_dev_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_set_master_dev_t>(),
        1usize,
        concat!("Size of: ", stringify!(bb_set_master_dev_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_set_master_dev_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_set_master_dev_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).slot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_master_dev_t),
            "::",
            stringify!(slot)
        )
    );
}
#[doc = "定义设置命令BB_SET_CANDIDATES的输入参数结构"]
pub type bb_set_candidate_t = bb_conf_candidates_t;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_set_customer_key_in_t {
    #[doc = "<@note customer key的写入地址,共8个字节,按照4个字节倍数写入:0-从地址0开始写入, 1-从地址4开始写入"]
    pub addr: u8,
    #[doc = "<@note customer key的写入长度"]
    pub len: u8,
    #[doc = "<@note customer key"]
    pub data: [u8; 8usize],
}
#[test]
fn bindgen_test_layout_bb_set_customer_key_in_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_set_customer_key_in_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_set_customer_key_in_t>(),
        10usize,
        concat!("Size of: ", stringify!(bb_set_customer_key_in_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_set_customer_key_in_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_set_customer_key_in_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_customer_key_in_t),
            "::",
            stringify!(addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).len) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_customer_key_in_t),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_customer_key_in_t),
            "::",
            stringify!(data)
        )
    );
}
#[doc = "定义设置命令BB_SET_REG的输入参数结构"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bb_set_reg_t {
    #[doc = "<@note 设置基带寄存器偏移量，应<BB_REG_PAGE_NUM*BB_REG_PAGE_SIZE"]
    pub offset: u16,
    #[doc = "<@note 设置基带寄存器的字节长度，应<=BB_REG_PAGE_SIZE并且不超过寄存器空间有效范围"]
    pub length: u16,
    #[doc = "<@note 设置基带寄存器的内容"]
    pub data: [u8; 256usize],
}
#[test]
fn bindgen_test_layout_bb_set_reg_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_set_reg_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_set_reg_t>(),
        260usize,
        concat!("Size of: ", stringify!(bb_set_reg_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_set_reg_t>(),
        2usize,
        concat!("Alignment of ", stringify!(bb_set_reg_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offset) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_reg_t),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).length) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_reg_t),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_reg_t),
            "::",
            stringify!(data)
        )
    );
}
impl Default for bb_set_reg_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "定义设置命令BB_SET_CFG的输入参数结构"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bb_set_cfg_t {
    #[doc = "<@note 命令序列号，单调递增"]
    pub seq: u32,
    #[doc = "<@note 基带配置文件总长度"]
    pub total_length: u16,
    #[doc = "<@note 基带配置文件crc16校验码"]
    pub total_crc16: u16,
    #[doc = "<@note 设置基带配置文件偏移量"]
    pub offset: u16,
    #[doc = "<@note data字节长度"]
    pub length: u16,
    #[doc = "<@note 设置基带配置文件的内容,注意：结构体的总大小不能大于1024"]
    pub data: [u8; 1012usize],
}
#[test]
fn bindgen_test_layout_bb_set_cfg_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_set_cfg_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_set_cfg_t>(),
        1024usize,
        concat!("Size of: ", stringify!(bb_set_cfg_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_set_cfg_t>(),
        4usize,
        concat!("Alignment of ", stringify!(bb_set_cfg_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).seq) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_cfg_t),
            "::",
            stringify!(seq)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).total_length) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_cfg_t),
            "::",
            stringify!(total_length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).total_crc16) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_cfg_t),
            "::",
            stringify!(total_crc16)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offset) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_cfg_t),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).length) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_cfg_t),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_cfg_t),
            "::",
            stringify!(data)
        )
    );
}
impl Default for bb_set_cfg_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "定义设置命令BB_SET_PLOT的输入参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_set_plot_t {
    #[doc = "<@note 需要plot的物理用户 类型：bb_user_e"]
    pub user: u8,
    #[doc = "<@note 使能plot与否 1：使能 0：关闭"]
    pub enable: u8,
    #[doc = "<@note 缓存多少个点后发送回调事件 不大于BB_PLOT_POINT_MAX"]
    pub cache_num: u8,
}
#[test]
fn bindgen_test_layout_bb_set_plot_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_set_plot_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_set_plot_t>(),
        3usize,
        concat!("Size of: ", stringify!(bb_set_plot_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_set_plot_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_set_plot_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).user) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_plot_t),
            "::",
            stringify!(user)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enable) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_plot_t),
            "::",
            stringify!(enable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cache_num) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_plot_t),
            "::",
            stringify!(cache_num)
        )
    );
}
#[doc = "定义FSP事件参数结构"]
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_event_fsp_param_t {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub __bindgen_padding_0: [u8; 3usize],
}
#[test]
fn bindgen_test_layout_bb_event_fsp_param_t() {
    assert_eq!(
        ::std::mem::size_of::<bb_event_fsp_param_t>(),
        4usize,
        concat!("Size of: ", stringify!(bb_event_fsp_param_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_event_fsp_param_t>(),
        4usize,
        concat!("Alignment of ", stringify!(bb_event_fsp_param_t))
    );
}
impl bb_event_fsp_param_t {
    #[inline]
    pub fn sub_event_bmp(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_sub_event_bmp(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(sub_event_bmp: u32) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let sub_event_bmp: u32 = unsafe { ::std::mem::transmute(sub_event_bmp) };
            sub_event_bmp as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "定义设置命令BB_SET_DBG_MODE的输入参数结构"]
pub type bb_set_dbg_mode_t = bb_get_dbg_mode_out_t;
#[doc = "定义设置命令BB_SET_POWER_MODE的输入参数结构"]
pub type bb_set_pwr_mode_in_t = bb_get_pwr_mode_out_t;
#[doc = "定义设置命令BB_SET_POWER的输入参数结构"]
pub type bb_set_pwr_in_t = bb_get_cur_pwr_out_t;
#[doc = "定义设置命令BB_SET_POWER_AUTO的输入参数结构"]
pub type bb_set_pwr_auto_in_t = bb_get_pwr_auto_out_t;
#[doc = "定义设置命令BB_SET_FREQ的输入参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_set_freq_t {
    #[doc = "<@note 需要设置频率的物理用户 类型：bb_user_e"]
    pub user: u8,
    #[doc = "<@note 发送或接收方向的bitmap （bb_dir_e的bit掩码）"]
    pub dir_bmp: u8,
    #[doc = "<@note 频率值 单位：KHz"]
    pub freq_khz: u32,
}
#[test]
fn bindgen_test_layout_bb_set_freq_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_set_freq_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_set_freq_t>(),
        8usize,
        concat!("Size of: ", stringify!(bb_set_freq_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_set_freq_t>(),
        4usize,
        concat!("Alignment of ", stringify!(bb_set_freq_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).user) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_freq_t),
            "::",
            stringify!(user)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dir_bmp) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_freq_t),
            "::",
            stringify!(dir_bmp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).freq_khz) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_freq_t),
            "::",
            stringify!(freq_khz)
        )
    );
}
#[doc = "定义设置命令BB_SET_TX_MCS的输入参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_set_tx_mcs_t {
    #[doc = "<@note 需要设置MCS的物理用户，仅数据用户支持 类型：bb_user_e"]
    pub user: u8,
    #[doc = "<@note MCS等级 类型：bb_phy_mcs_e"]
    pub mcs: u8,
}
#[test]
fn bindgen_test_layout_bb_set_tx_mcs_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_set_tx_mcs_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_set_tx_mcs_t>(),
        2usize,
        concat!("Size of: ", stringify!(bb_set_tx_mcs_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_set_tx_mcs_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_set_tx_mcs_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).user) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_tx_mcs_t),
            "::",
            stringify!(user)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mcs) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_tx_mcs_t),
            "::",
            stringify!(mcs)
        )
    );
}
#[doc = "定义设置命令BB_SET_REET的输入参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_set_reset_t {
    #[doc = "<@attension 需要复位的物理用户，仅数据用户支持（如果>= BB_DATA_USER_MAX则进行基带复位） 类型：bb_user_e"]
    pub user: u8,
    #[doc = "<@note 发送或接收方向的bitmap （bb_dir_e的bit掩码）"]
    pub dir_bmp: u8,
}
#[test]
fn bindgen_test_layout_bb_set_reset_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_set_reset_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_set_reset_t>(),
        2usize,
        concat!("Size of: ", stringify!(bb_set_reset_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_set_reset_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_set_reset_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).user) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_reset_t),
            "::",
            stringify!(user)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dir_bmp) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_reset_t),
            "::",
            stringify!(dir_bmp)
        )
    );
}
#[doc = "定义设置命令 BB_SET_SYS_REBOOT 的输入参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_set_reboot_t {
    #[doc = "<@note 复位参数 单位毫秒"]
    pub tim_ms: u32,
}
#[test]
fn bindgen_test_layout_bb_set_reboot_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_set_reboot_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_set_reboot_t>(),
        4usize,
        concat!("Size of: ", stringify!(bb_set_reboot_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_set_reboot_t>(),
        4usize,
        concat!("Alignment of ", stringify!(bb_set_reboot_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tim_ms) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_reboot_t),
            "::",
            stringify!(tim_ms)
        )
    );
}
#[doc = "定义设置命令BB_SET_TX_PATH的输入参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_set_tx_path_t {
    #[doc = "<@attention 射频通道的bitmap"]
    pub path_bmp: u8,
}
#[test]
fn bindgen_test_layout_bb_set_tx_path_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_set_tx_path_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_set_tx_path_t>(),
        1usize,
        concat!("Size of: ", stringify!(bb_set_tx_path_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_set_tx_path_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_set_tx_path_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).path_bmp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_tx_path_t),
            "::",
            stringify!(path_bmp)
        )
    );
}
#[doc = "定义读取命令BB_GET_TX_PATH的输入参数结构"]
pub type bb_get_tx_path_t = bb_set_tx_path_t;
#[doc = "定义设置命令BB_SET_RX_PATH的输入参数结构"]
pub type bb_set_rx_path_t = bb_set_tx_path_t;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_set_orig_cfg_t {
    pub role: u8,
}
#[test]
fn bindgen_test_layout_bb_set_orig_cfg_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_set_orig_cfg_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_set_orig_cfg_t>(),
        1usize,
        concat!("Size of: ", stringify!(bb_set_orig_cfg_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_set_orig_cfg_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_set_orig_cfg_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).role) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_orig_cfg_t),
            "::",
            stringify!(role)
        )
    );
}
#[doc = "定义设置命令BB_SET_RF的输入参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_set_rf_t {
    #[doc = "<@attention 射频AB路 类型：bb_rf_path_e"]
    pub rf_path: u8,
    #[doc = "<@attention 射频收发方向 类型：bb_dir_e"]
    pub dir: u8,
    #[doc = "<@attention RF目标状态 0：关 1：开"]
    pub state: u8,
}
#[test]
fn bindgen_test_layout_bb_set_rf_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_set_rf_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_set_rf_t>(),
        3usize,
        concat!("Size of: ", stringify!(bb_set_rf_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_set_rf_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_set_rf_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rf_path) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_rf_t),
            "::",
            stringify!(rf_path)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dir) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_rf_t),
            "::",
            stringify!(dir)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).state) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_rf_t),
            "::",
            stringify!(state)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_frame_plot_t {
    #[doc = "<@note 帧帧上报发生的时间"]
    pub timestamp: u32,
    #[doc = "<@note 频偏"]
    pub freq_off: ::std::os::raw::c_int,
    #[doc = "<@note DEV自己的帧号，只dev生效"]
    pub frame_no: u16,
    #[doc = "<@note DEV收到ap的帧号，只dev生效"]
    pub frame_no_peer: u16,
    #[doc = "<@note 同步的帧号"]
    pub frame_no_sync: u16,
    #[doc = "<@note A路天线GAIN"]
    pub gain_a: u8,
    #[doc = "<@note B路天线GAIN"]
    pub gain_b: u8,
    #[doc = "<@note 信噪比"]
    pub snr: u16,
    pub pre_snr: u16,
    #[doc = "<@note LDPC错误数"]
    pub ldpc_err: u16,
    #[doc = "<@note LDPC总数"]
    pub ldpc_num: u16,
    pub work_ch: u32,
    pub br_ch: u32,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    #[doc = "<@note 主径"]
    pub loc: u8,
    #[doc = "<@note 上次扫频的结果"]
    pub fs_power: i8,
    pub _bitfield_align_2: [u8; 0],
    pub _bitfield_2: __BindgenBitfieldUnit<[u8; 5usize]>,
    pub priv_state: u16,
    pub priv_state_err: u16,
    pub priv_id: [u8; 4usize],
    #[doc = "<@note 私有，需要全部上报"]
    pub priv_8: [u8; 8usize],
    pub priv_16: [u16; 4usize],
    pub priv_32: [u32; 2usize],
}
#[test]
fn bindgen_test_layout_bb_frame_plot_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_frame_plot_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_frame_plot_t>(),
        72usize,
        concat!("Size of: ", stringify!(bb_frame_plot_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_frame_plot_t>(),
        4usize,
        concat!("Alignment of ", stringify!(bb_frame_plot_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timestamp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_frame_plot_t),
            "::",
            stringify!(timestamp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).freq_off) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_frame_plot_t),
            "::",
            stringify!(freq_off)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frame_no) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_frame_plot_t),
            "::",
            stringify!(frame_no)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frame_no_peer) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_frame_plot_t),
            "::",
            stringify!(frame_no_peer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frame_no_sync) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_frame_plot_t),
            "::",
            stringify!(frame_no_sync)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gain_a) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_frame_plot_t),
            "::",
            stringify!(gain_a)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gain_b) as usize - ptr as usize },
        15usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_frame_plot_t),
            "::",
            stringify!(gain_b)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).snr) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_frame_plot_t),
            "::",
            stringify!(snr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pre_snr) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_frame_plot_t),
            "::",
            stringify!(pre_snr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ldpc_err) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_frame_plot_t),
            "::",
            stringify!(ldpc_err)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ldpc_num) as usize - ptr as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_frame_plot_t),
            "::",
            stringify!(ldpc_num)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).work_ch) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_frame_plot_t),
            "::",
            stringify!(work_ch)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).br_ch) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_frame_plot_t),
            "::",
            stringify!(br_ch)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).loc) as usize - ptr as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_frame_plot_t),
            "::",
            stringify!(loc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fs_power) as usize - ptr as usize },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_frame_plot_t),
            "::",
            stringify!(fs_power)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).priv_state) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_frame_plot_t),
            "::",
            stringify!(priv_state)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).priv_state_err) as usize - ptr as usize },
        42usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_frame_plot_t),
            "::",
            stringify!(priv_state_err)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).priv_id) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_frame_plot_t),
            "::",
            stringify!(priv_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).priv_8) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_frame_plot_t),
            "::",
            stringify!(priv_8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).priv_16) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_frame_plot_t),
            "::",
            stringify!(priv_16)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).priv_32) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_frame_plot_t),
            "::",
            stringify!(priv_32)
        )
    );
}
impl bb_frame_plot_t {
    #[inline]
    pub fn work_bw(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 3u8) as u8) }
    }
    #[inline]
    pub fn set_work_bw(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn br_bw(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 3u8) as u8) }
    }
    #[inline]
    pub fn set_br_bw(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn fch_lock(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_fch_lock(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        work_bw: u8,
        br_bw: u8,
        fch_lock: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 3u8, {
            let work_bw: u8 = unsafe { ::std::mem::transmute(work_bw) };
            work_bw as u64
        });
        __bindgen_bitfield_unit.set(3usize, 3u8, {
            let br_bw: u8 = unsafe { ::std::mem::transmute(br_bw) };
            br_bw as u64
        });
        __bindgen_bitfield_unit.set(6usize, 2u8, {
            let fch_lock: u8 = unsafe { ::std::mem::transmute(fch_lock) };
            fch_lock as u64
        });
        __bindgen_bitfield_unit
    }
    #[inline]
    pub fn fs_ch(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_2.get(0usize, 5u8) as u8) }
    }
    #[inline]
    pub fn set_fs_ch(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_2.set(0usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn fs_bw(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_2.get(5usize, 3u8) as u8) }
    }
    #[inline]
    pub fn set_fs_bw(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_2.set(5usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn mcs_tx(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_2.get(8usize, 5u8) as u8) }
    }
    #[inline]
    pub fn set_mcs_tx(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_2.set(8usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn mcs_rx(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_2.get(16usize, 5u8) as u8) }
    }
    #[inline]
    pub fn set_mcs_rx(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_2.set(16usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn power_tx(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_2.get(24usize, 5u8) as u8) }
    }
    #[inline]
    pub fn set_power_tx(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_2.set(24usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn power_rx(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_2.get(32usize, 5u8) as u8) }
    }
    #[inline]
    pub fn set_power_rx(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_2.set(32usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_2(
        fs_ch: u8,
        fs_bw: u8,
        mcs_tx: u8,
        mcs_rx: u8,
        power_tx: u8,
        power_rx: u8,
    ) -> __BindgenBitfieldUnit<[u8; 5usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 5usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 5u8, {
            let fs_ch: u8 = unsafe { ::std::mem::transmute(fs_ch) };
            fs_ch as u64
        });
        __bindgen_bitfield_unit.set(5usize, 3u8, {
            let fs_bw: u8 = unsafe { ::std::mem::transmute(fs_bw) };
            fs_bw as u64
        });
        __bindgen_bitfield_unit.set(8usize, 5u8, {
            let mcs_tx: u8 = unsafe { ::std::mem::transmute(mcs_tx) };
            mcs_tx as u64
        });
        __bindgen_bitfield_unit.set(16usize, 5u8, {
            let mcs_rx: u8 = unsafe { ::std::mem::transmute(mcs_rx) };
            mcs_rx as u64
        });
        __bindgen_bitfield_unit.set(24usize, 5u8, {
            let power_tx: u8 = unsafe { ::std::mem::transmute(power_tx) };
            power_tx as u64
        });
        __bindgen_bitfield_unit.set(32usize, 5u8, {
            let power_rx: u8 = unsafe { ::std::mem::transmute(power_rx) };
            power_rx as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bb_frame_plot_api_t {
    pub base: bb_frame_plot_t,
    pub rsv: [u8; 184usize],
}
#[test]
fn bindgen_test_layout_bb_frame_plot_api_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_frame_plot_api_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_frame_plot_api_t>(),
        256usize,
        concat!("Size of: ", stringify!(bb_frame_plot_api_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_frame_plot_api_t>(),
        4usize,
        concat!("Alignment of ", stringify!(bb_frame_plot_api_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).base) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_frame_plot_api_t),
            "::",
            stringify!(base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rsv) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_frame_plot_api_t),
            "::",
            stringify!(rsv)
        )
    );
}
impl Default for bb_frame_plot_api_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_frame_cfg_t {
    #[doc = "<@note 缓存多少帧一起上报，0代表不上报"]
    pub cache: u8,
    #[doc = "<@note 隔几帧记录一次，0代表每帧记录"]
    pub limit: u8,
}
#[test]
fn bindgen_test_layout_bb_frame_cfg_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_frame_cfg_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_frame_cfg_t>(),
        2usize,
        concat!("Size of: ", stringify!(bb_frame_cfg_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_frame_cfg_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_frame_cfg_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cache) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_frame_cfg_t),
            "::",
            stringify!(cache)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).limit) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_frame_cfg_t),
            "::",
            stringify!(limit)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bb_frame_cfg_api_t {
    pub base: bb_frame_cfg_t,
    pub rsv: [u8; 200usize],
}
#[test]
fn bindgen_test_layout_bb_frame_cfg_api_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_frame_cfg_api_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_frame_cfg_api_t>(),
        202usize,
        concat!("Size of: ", stringify!(bb_frame_cfg_api_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_frame_cfg_api_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_frame_cfg_api_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).base) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_frame_cfg_api_t),
            "::",
            stringify!(base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rsv) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_frame_cfg_api_t),
            "::",
            stringify!(rsv)
        )
    );
}
impl Default for bb_frame_cfg_api_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "定义设置命令BB_SET_POWER_OFFSET的输入参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_set_power_offset_t {
    #[doc = "<@attention 频段，取值参见bb_band_e"]
    pub band: u8,
    #[doc = "<@attention 功率补偿值"]
    pub offset: i8,
    #[doc = "<@attention 参见bb_rf_path_e"]
    pub path: u8,
    pub rsv: u8,
}
#[test]
fn bindgen_test_layout_bb_set_power_offset_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_set_power_offset_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_set_power_offset_t>(),
        4usize,
        concat!("Size of: ", stringify!(bb_set_power_offset_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_set_power_offset_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_set_power_offset_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).band) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_power_offset_t),
            "::",
            stringify!(band)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offset) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_power_offset_t),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).path) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_power_offset_t),
            "::",
            stringify!(path)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rsv) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_power_offset_t),
            "::",
            stringify!(rsv)
        )
    );
}
#[doc = "定义设置命令BB_GET_POWER_OFFSET的输入参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_get_power_offset_in_t {
    #[doc = "<@attention 频段，取值参见bb_band_e"]
    pub band: u8,
    pub path: u8,
    #[doc = "<@note 保留字段"]
    pub rsv: u16,
}
#[test]
fn bindgen_test_layout_bb_get_power_offset_in_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_get_power_offset_in_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_get_power_offset_in_t>(),
        4usize,
        concat!("Size of: ", stringify!(bb_get_power_offset_in_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_get_power_offset_in_t>(),
        2usize,
        concat!("Alignment of ", stringify!(bb_get_power_offset_in_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).band) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_power_offset_in_t),
            "::",
            stringify!(band)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).path) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_power_offset_in_t),
            "::",
            stringify!(path)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rsv) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_power_offset_in_t),
            "::",
            stringify!(rsv)
        )
    );
}
#[doc = "定义设置命令BB_GET_POWER_OFFSET的输出参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_get_power_offset_out_t {
    pub offset: i8,
}
#[test]
fn bindgen_test_layout_bb_get_power_offset_out_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_get_power_offset_out_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_get_power_offset_out_t>(),
        1usize,
        concat!("Size of: ", stringify!(bb_get_power_offset_out_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_get_power_offset_out_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_get_power_offset_out_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offset) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_power_offset_out_t),
            "::",
            stringify!(offset)
        )
    );
}
#[doc = "定义设置命令BB_GET_POWER_OFFSET2的输入参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_get_power_offset2_in_t {
    #[doc = "<@attention 频段，取值参见bb_band_e"]
    pub band: u8,
    #[doc = "<@note 保留字段"]
    pub rsv: [u8; 3usize],
}
#[test]
fn bindgen_test_layout_bb_get_power_offset2_in_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_get_power_offset2_in_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_get_power_offset2_in_t>(),
        4usize,
        concat!("Size of: ", stringify!(bb_get_power_offset2_in_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_get_power_offset2_in_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_get_power_offset2_in_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).band) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_power_offset2_in_t),
            "::",
            stringify!(band)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rsv) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_power_offset2_in_t),
            "::",
            stringify!(rsv)
        )
    );
}
#[doc = "定义设置命令BB_GET_POWER_OFFSET2的输出参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_get_power_offset2_out_t {
    #[doc = "<@attention a路功率校准值"]
    pub path_a: i8,
    #[doc = "<@attention b路功率校准值"]
    pub path_b: i8,
    #[doc = "<@note 保留字段"]
    pub rsv: [u8; 2usize],
}
#[test]
fn bindgen_test_layout_bb_get_power_offset2_out_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_get_power_offset2_out_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_get_power_offset2_out_t>(),
        4usize,
        concat!("Size of: ", stringify!(bb_get_power_offset2_out_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_get_power_offset2_out_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_get_power_offset2_out_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).path_a) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_power_offset2_out_t),
            "::",
            stringify!(path_a)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).path_b) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_power_offset2_out_t),
            "::",
            stringify!(path_b)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rsv) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_power_offset2_out_t),
            "::",
            stringify!(rsv)
        )
    );
}
#[doc = "定义设置命令BB_GET_CUSTOMER_KEY的输出参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_get_customer_key_out_t {
    #[doc = "<@note customer key"]
    pub data: [u8; 8usize],
}
#[test]
fn bindgen_test_layout_bb_get_customer_key_out_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_get_customer_key_out_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_get_customer_key_out_t>(),
        8usize,
        concat!("Size of: ", stringify!(bb_get_customer_key_out_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_get_customer_key_out_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_get_customer_key_out_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_get_customer_key_out_t),
            "::",
            stringify!(data)
        )
    );
}
#[doc = "定义设置命令BB_SET_HOT_UPGRADE_WRITE的输入参数结构"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bb_set_hot_upgrade_write_in_t {
    #[doc = "<@note 命令字序列号, 可以任意产生"]
    pub seq: u16,
    #[doc = "<@note data中数据的长度"]
    pub len: u16,
    #[doc = "<@note 写入地址"]
    pub addr: u32,
    #[doc = "<@note 数据内容"]
    pub data: [u8; 1016usize],
}
#[test]
fn bindgen_test_layout_bb_set_hot_upgrade_write_in_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_set_hot_upgrade_write_in_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_set_hot_upgrade_write_in_t>(),
        1024usize,
        concat!("Size of: ", stringify!(bb_set_hot_upgrade_write_in_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_set_hot_upgrade_write_in_t>(),
        4usize,
        concat!("Alignment of ", stringify!(bb_set_hot_upgrade_write_in_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).seq) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_hot_upgrade_write_in_t),
            "::",
            stringify!(seq)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).len) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_hot_upgrade_write_in_t),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addr) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_hot_upgrade_write_in_t),
            "::",
            stringify!(addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_hot_upgrade_write_in_t),
            "::",
            stringify!(data)
        )
    );
}
impl Default for bb_set_hot_upgrade_write_in_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "定义设置命令BB_SET_HOT_UPGRADE_WRITE的输出参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_set_hot_upgrade_write_out_t {
    #[doc = "<@note 命令字序列号，可以任意产生"]
    pub seq: u16,
    #[doc = "<@note 命令执行结果，参见bb_errno"]
    pub ret: i16,
}
#[test]
fn bindgen_test_layout_bb_set_hot_upgrade_write_out_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_set_hot_upgrade_write_out_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_set_hot_upgrade_write_out_t>(),
        4usize,
        concat!("Size of: ", stringify!(bb_set_hot_upgrade_write_out_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_set_hot_upgrade_write_out_t>(),
        2usize,
        concat!("Alignment of ", stringify!(bb_set_hot_upgrade_write_out_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).seq) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_hot_upgrade_write_out_t),
            "::",
            stringify!(seq)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ret) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_hot_upgrade_write_out_t),
            "::",
            stringify!(ret)
        )
    );
}
#[doc = "定义设置命令BB_SET_HOT_UPGRADE_CRC32的输入参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_set_hot_upgrade_crc32_in_t {
    #[doc = "<@note 命令字序列号，可以任意产生"]
    pub seq: u16,
    #[doc = "<@note reserve"]
    pub reserve: u16,
    #[doc = "<@note crc32校验数据的长度"]
    pub len: u32,
    #[doc = "<@note 待校验的数据地址"]
    pub addr: u32,
    #[doc = "<@note crc32校验值"]
    pub crc32: u32,
}
#[test]
fn bindgen_test_layout_bb_set_hot_upgrade_crc32_in_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_set_hot_upgrade_crc32_in_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_set_hot_upgrade_crc32_in_t>(),
        16usize,
        concat!("Size of: ", stringify!(bb_set_hot_upgrade_crc32_in_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_set_hot_upgrade_crc32_in_t>(),
        4usize,
        concat!("Alignment of ", stringify!(bb_set_hot_upgrade_crc32_in_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).seq) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_hot_upgrade_crc32_in_t),
            "::",
            stringify!(seq)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserve) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_hot_upgrade_crc32_in_t),
            "::",
            stringify!(reserve)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).len) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_hot_upgrade_crc32_in_t),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_hot_upgrade_crc32_in_t),
            "::",
            stringify!(addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).crc32) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_hot_upgrade_crc32_in_t),
            "::",
            stringify!(crc32)
        )
    );
}
#[doc = "定义读取命令BB_SET_PRJ_DISPATCH的输入参数结构"]
pub type bb_set_prj_dispatch_in_t = bb_get_prj_dispatch_in_t;
#[doc = "定义读取命令BB_SET_PRJ_DISPATCH2的输入参数结构"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bb_set_prj_dispatch2_in_t {
    pub data: [u8; 1024usize],
}
#[test]
fn bindgen_test_layout_bb_set_prj_dispatch2_in_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_set_prj_dispatch2_in_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_set_prj_dispatch2_in_t>(),
        1024usize,
        concat!("Size of: ", stringify!(bb_set_prj_dispatch2_in_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_set_prj_dispatch2_in_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_set_prj_dispatch2_in_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_prj_dispatch2_in_t),
            "::",
            stringify!(data)
        )
    );
}
impl Default for bb_set_prj_dispatch2_in_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "定义设置命令BB_SET_FRAME_CHANGE的输入参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_set_frame_change_t {
    #[doc = "<@note mode=1执行交换(40M), mode=2(20M)，mode=3(10M), mode=0恢复原始帧结构"]
    pub mode: u8,
}
#[test]
fn bindgen_test_layout_bb_set_frame_change_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_set_frame_change_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_set_frame_change_t>(),
        1usize,
        concat!("Size of: ", stringify!(bb_set_frame_change_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_set_frame_change_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_set_frame_change_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_frame_change_t),
            "::",
            stringify!(mode)
        )
    );
}
#[doc = "定义设置命令BB_SET_COMPLIANCE_MODE的输入参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_set_compliance_mode_t {
    #[doc = "<@note 1=使能合规模式，0=自由模式"]
    pub enable: u8,
}
#[test]
fn bindgen_test_layout_bb_set_compliance_mode_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_set_compliance_mode_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_set_compliance_mode_t>(),
        1usize,
        concat!("Size of: ", stringify!(bb_set_compliance_mode_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_set_compliance_mode_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_set_compliance_mode_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enable) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_compliance_mode_t),
            "::",
            stringify!(enable)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_set_band_mode_t {
    pub auto_mode: u8,
}
#[test]
fn bindgen_test_layout_bb_set_band_mode_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_set_band_mode_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_set_band_mode_t>(),
        1usize,
        concat!("Size of: ", stringify!(bb_set_band_mode_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_set_band_mode_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_set_band_mode_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).auto_mode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_band_mode_t),
            "::",
            stringify!(auto_mode)
        )
    );
}
#[doc = "定义设置命令BB_SET_BAND的输入参数结构"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_set_band_t {
    #[doc = "<@note 设置的目标band"]
    pub target_band: u8,
}
#[test]
fn bindgen_test_layout_bb_set_band_t() {
    const UNINIT: ::std::mem::MaybeUninit<bb_set_band_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bb_set_band_t>(),
        1usize,
        concat!("Size of: ", stringify!(bb_set_band_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bb_set_band_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bb_set_band_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target_band) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bb_set_band_t),
            "::",
            stringify!(target_band)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bb_force_close_socket_t {
    #[doc = "<@note 设置的目标slot"]
    pub slot: u8,
    #[doc = "<@note 设置的目标port"]
    pub port: u8,
}
#[test]
